{"root": {"paper_id": "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "paper_title": "BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding", "paper_year": 2018, "paper_venue": "NAACL-HLT", "paper_citations": 1, "paper_abstract": "We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models, BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. \nBERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5% (7.7% point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).", "paper_authors": ["Jacob Devlin", "Ming-Wei Chang", "Kenton Lee", "Kristina Toutanova"], "citations": [], "references": ["007ab5528b3bd310a80d553cccad4b78dc496b02", "10f97f1fb4f5c2c8e6c44d4a33da46d331dd4aeb", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "128cb6b891aee1b5df099acb48e2efecfcff689f", "05dd7254b632376973f3a1b4d39485da17814df5", "bc1d609520290e0460c49b685675eb5a57fa5935", "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb", "4361e64f2d12d63476fdc88faf72a0f70d9a2ffb", "26e743d5bd465f49b9538deaf116c15e61b7951f", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "93b8da28d006415866bf48f9a6e06b5242129195", "8c1b00128e74f1cd92aede3959690615695d5101", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "766ce989b8b8b984f7a4691fd8c9af4bdb2b74cd", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "1005645c05585c2042e3410daeed638b55e2474d", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "2c5135a0531bc5ad7dd890f018e67a40529f5bcb", "27e98e09cf09bc13c913d01676e5f32624011050", "843959ffdccf31c6694d135fad07425924f785b1", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "1e077413b25c4d34945cc2707e17e46ed4fe784a", "5d833331b0e22ff359db05c62a8bca18c4f04b68", "1510cf4b8abea80b9f352325ca4c132887de21a0", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "1a07186bc10592f0330655519ad91652125cd907", "e0222a1ae6874f7fff128c3da8769ab95963da04", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "38211dc39e41273c0007889202c69f841e02248a", "687bac2d3320083eb4530bf18bb8f8f721477600", "081651b38ff7533550a3adfc1c00da333a8fe86c", "26b47e35fe6e4260fdf7b7cc98f279a73c277494", "f010affab57b5fcf1cd6be23df79d8ec98c7289c", "59761abc736397539bdd01ad7f9d91c8607c0457", "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "dac72f2c509aee67524d3321f77e97e8eff51de6", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "421fc2556836a6b441de806d7b393a35b6eaea58", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "0e6824e137847be0599bb0032e37042ed2ef5045", "475354f10798f110d34792b6d88f31d6d5cb099e", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "3c78c6df5eb1695b6a399e346dde880af27d1016", "783480acff435bfbc15ffcdb4f15eccddaa0c810", "9fa8d73e572c3ca824a04a5f551b602a17831bc5", "b9de9599d7241459db9213b5cdd7059696f5ef8d", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "score": 1.0}, "branches": [[[{"paper_id": "38211dc39e41273c0007889202c69f841e02248a", "paper_title": "ImageNet: A large-scale hierarchical image database", "paper_year": 2009, "paper_venue": "2009 IEEE Conference on Computer Vision and Pattern Recognition", "paper_citations": 36, "paper_abstract": "The explosion of image data on the Internet has the potential to foster more sophisticated and robust models and algorithms to index, retrieve, organize and interact with images and multimedia data. But exactly how such data can be harnessed and organized remains a critical problem. We introduce here a new database called “ImageNet”, a large-scale ontology of images built upon the backbone of the WordNet structure. ImageNet aims to populate the majority of the 80,000 synsets of WordNet with an average of 500-1000 clean and full resolution images. This will result in tens of millions of annotated images organized by the semantic hierarchy of WordNet. This paper offers a detailed analysis of ImageNet in its current state: 12 subtrees with 5247 synsets and 3.2 million images in total. We show that ImageNet is much larger in scale and diversity and much more accurate than the current image datasets. Constructing such a large-scale database is a challenging task. We describe the data collection scheme with Amazon Mechanical Turk. Lastly, we illustrate the usefulness of ImageNet through three simple applications in object recognition, image classification and automatic object clustering. We hope that the scale, accuracy, diversity and hierarchical structure of ImageNet can offer unparalleled opportunities to researchers in the computer vision community and beyond.", "paper_authors": ["Jia Deng", "Wei Dong", "Richard Socher", "Li-Jia Li", "Kai Li", "Fei-Fei Li"], "citations": ["e74f9b7f8eec6ba4704c206b93bc8079af3da4bd", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "05dd7254b632376973f3a1b4d39485da17814df5", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "061356704ec86334dbbc073985375fe13cd39088", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "05aba481e8a221df5d8775a3bb749001e7f2525e", "71b7178df5d2b112d07e45038cb5637208659ff7", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "081651b38ff7533550a3adfc1c00da333a8fe86c"], "references": ["d87ceda3042f781c341ac17109d1e94a717f5f60"], "score": 1.3593662737025234}, {"paper_id": "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "paper_title": "Learned in Translation: Contextualized Word Vectors", "paper_year": 2017, "paper_venue": "NIPS", "paper_citations": 15, "paper_abstract": "Computer vision has benefited from initializing multiple deep layers with weights pretrained on large supervised training sets like ImageNet. Natural language processing (NLP) typically sees initialization of only the lowest layer of deep models with pretrained word vectors. In this paper, we use a deep LSTM encoder from an attentional sequence-to-sequence model trained for machine translation (MT) to contextualize word vectors. We show that adding these context vectors (CoVe) improves performance over using only unsupervised word and character vectors on a wide variety of common NLP tasks: sentiment analysis (SST, IMDb), question classification (TREC), entailment (SNLI), and question answering (SQuAD). For fine-grained sentiment analysis and entailment, CoVe improves performance of our baseline models to the state of the art.", "paper_authors": ["Bryan McCann", "James Bradbury", "Caiming Xiong", "Richard Socher"], "citations": ["93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "1e077413b25c4d34945cc2707e17e46ed4fe784a", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "ac11062f1f368d97f4c826c317bf50dcc13fdb59"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "007ab5528b3bd310a80d553cccad4b78dc496b02", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "05dd7254b632376973f3a1b4d39485da17814df5", "39dba6f22d72853561a4ed684be265e179a39e4f", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "26e743d5bd465f49b9538deaf116c15e61b7951f", "071b16f25117fb6133480c6259227d54fc2a5ea0", "2c03df8b48bf3fa39054345bafabfeff15bfd11d", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "38211dc39e41273c0007889202c69f841e02248a", "687bac2d3320083eb4530bf18bb8f8f721477600", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "061356704ec86334dbbc073985375fe13cd39088", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "93499a7c7f699b6630a86fad964536f9423bb6d0", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "score": 1.6252669311366348}, {"paper_id": "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "paper_title": "A Decomposable Attention Model for Natural Language Inference", "paper_year": 2016, "paper_venue": "EMNLP", "paper_citations": 32, "paper_abstract": "We propose a simple neural architecture for natural language inference. Our approach uses attention to decompose the problem into subproblems that can be solved separately, thus making it trivially parallelizable. On the Stanford Natural Language Inference (SNLI) dataset, we obtain state-of-the-art results with almost an order of magnitude fewer parameters than previous work and without relying on any word-order information. Adding intra-sentence attention that takes a minimum amount of order into account yields further improvements.", "paper_authors": ["Ankur P. Parikh", "Oscar Täckström", "Dipanjan Das", "Jakob Uszkoreit"], "citations": ["5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "05aba481e8a221df5d8775a3bb749001e7f2525e", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 1.562435889258007}, {"paper_id": "081651b38ff7533550a3adfc1c00da333a8fe86c", "paper_title": "How transferable are features in deep neural networks?", "paper_year": 2014, "paper_venue": "NIPS", "paper_citations": 6, "paper_abstract": "Many deep neural networks trained on natural images exhibit a curious phenomenon in common: on the first layer they learn features similar to Gabor filters and color blobs. Such first-layer features appear not to be specific to a particular dataset or task, but general in that they are applicable to many datasets and tasks. Features must eventually transition from general to specific by the last layer of the network, but this transition has not been studied extensively. In this paper we experimentally quantify the generality versus specificity of neurons in each layer of a deep convolutional neural network and report a few surprising results. Transferability is negatively affected by two distinct issues: (1) the specialization of higher layer neurons to their original task at the expense of performance on the target task, which was expected, and (2) optimization difficulties related to splitting networks between co-adapted neurons, which was not expected. In an example network trained on ImageNet, we demonstrate that either of these two issues may dominate, depending on whether features are transferred from the bottom, middle, or top of the network. We also document that the transferability of features decreases as the distance between the base task and target task increases, but that transferring features even from distant tasks can be better than using random features. A final surprising result is that initializing a network with transferred features from almost any number of layers can produce a boost to generalization that lingers even after fine-tuning to the target dataset.", "paper_authors": ["Jason Yosinski", "Jeff Clune", "Yoshua Bengio", "Hod Lipson"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "1e077413b25c4d34945cc2707e17e46ed4fe784a"], "references": ["38211dc39e41273c0007889202c69f841e02248a", "abd1c342495432171beb7ca8fd9551ef13cbd0ff"], "score": 1.443522425134828}, {"paper_id": "4361e64f2d12d63476fdc88faf72a0f70d9a2ffb", "paper_title": "Bridging Nonlinearities and Stochastic Regularizers with Gaussian Error Linear Units", "paper_year": 2017, "paper_venue": "ArXiv", "paper_citations": 3, "paper_abstract": "We propose the Gaussian Error Linear Unit (GELU), a high-performing neural network activation function. The GELU nonlinearity is the expected transformation of a stochastic regularizer which randomly applies the identity or zero map to a neuron's input. This stochastic regularizer is comparable to nonlinearities aided by dropout, but it removes the need for a traditional nonlinearity. The connection between the GELU and the stochastic regularizer suggests a new probabilistic understanding of nonlinearities. We perform an empirical evaluation of the GELU nonlinearity against the ReLU and ELU activations and find performance improvements across all tasks.", "paper_authors": ["Dan Hendrycks", "Kevin Gimpel"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035"], "references": ["061356704ec86334dbbc073985375fe13cd39088", "6c8b30f63f265c32e26d999aa1fef5286b8308ad", "272216c1f097706721096669d85b2843c23fa77d"], "score": 1.4414850137295634}], [{"paper_id": "a4cec122a08216fe8a3bc19b22e78fbaea096256", "paper_title": "Deep Learning", "paper_year": 2015, "paper_venue": "Nature", "paper_citations": 3, "paper_abstract": "Machine-learning technology powers many aspects of modern society: from web searches to content filtering on social networks to recommendations on e-commerce websites, and it is increasingly present in consumer products such as cameras and smartphones. Machine-learning systems are used to identify objects in images, transcribe speech into text, match news items, posts or products with users’ interests, and select relevant results of search. Increasingly, these applications make use of a class of techniques called deep learning. Conventional machine-learning techniques were limited in their ability to process natural data in their raw form. For decades, constructing a pattern-recognition or machine-learning system required careful engineering and considerable domain expertise to design a feature extractor that transformed the raw data (such as the pixel values of an image) into a suitable internal representation or feature vector from which the learning subsystem, often a classifier, could detect or classify patterns in the input. Representation learning is a set of methods that allows a machine to be fed with raw data and to automatically discover the representations needed for detection or classification. Deep-learning methods are representation-learning methods with multiple levels of representation, obtained by composing simple but non-linear modules that each transform the representation at one level (starting with the raw input) into a representation at a higher, slightly more abstract level. With the composition of enough such transformations, very complex functions can be learned. For classification tasks, higher layers of representation amplify aspects of the input that are important for discrimination and suppress irrelevant variations. An image, for example, comes in the form of an array of pixel values, and the learned features in the first layer of representation typically represent the presence or absence of edges at particular orientations and locations in the image. The second layer typically detects motifs by spotting particular arrangements of edges, regardless of small variations in the edge positions. The third layer may assemble motifs into larger combinations that correspond to parts of familiar objects, and subsequent layers would detect objects as combinations of these parts. The key aspect of deep learning is that these layers of features are not designed by human engineers: they are learned from data using a general-purpose learning procedure. Deep learning is making major advances in solving problems that have resisted the best attempts of the artificial intelligence community for many years. It has turned out to be very good at discovering intricate structures in high-dimensional data and is therefore applicable to many domains of science, business and government. In addition to beating records in image recognition and speech recognition, it has beaten other machine-learning techniques at predicting the activity of potential drug molecules, analysing particle accelerator data, reconstructing brain circuits, and predicting the effects of mutations in non-coding DNA on gene expression and disease. Perhaps more surprisingly, deep learning has produced extremely promising results for various tasks in natural language understanding, particularly topic classification, sentiment analysis, question answering and language translation. We think that deep learning will have many more successes in the near future because it requires very little engineering by hand, so it can easily take advantage of increases in the amount of available computation and data. New learning algorithms and architectures that are currently being developed for deep neural networks will only accelerate this progress.", "paper_authors": ["Ian G Goodfellow", "Yoshua Bengio", "Aaron C. Courville"], "citations": ["cb0f3ee1e98faf92429d601cdcd76c69c1e484eb"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "39dba6f22d72853561a4ed684be265e179a39e4f", "cfa2646776405d50533055ceb1b7f050e9014dcb", "05aba481e8a221df5d8775a3bb749001e7f2525e", "071b16f25117fb6133480c6259227d54fc2a5ea0", "0d67362a5630ec3b7562327acc278c1c996454b5", "162d958ff885f1462aeda91cd72582323fd6a1f4", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "1005645c05585c2042e3410daeed638b55e2474d", "146f6f6ed688c905fb6e346ad02332efd5464616", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "843959ffdccf31c6694d135fad07425924f785b1", "272216c1f097706721096669d85b2843c23fa77d", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "1a07186bc10592f0330655519ad91652125cd907", "38211dc39e41273c0007889202c69f841e02248a", "dac72f2c509aee67524d3321f77e97e8eff51de6", "687bac2d3320083eb4530bf18bb8f8f721477600", "e74f9b7f8eec6ba4704c206b93bc8079af3da4bd", "47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "23694a80bf1b9b38215be3e23068dd75296bc90f", "061356704ec86334dbbc073985375fe13cd39088", "0b544dfe355a5070b60986319a3f51fb45d1348e", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 0.48378797357206804}, {"paper_id": "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "paper_title": "ImageNet Classification with Deep Convolutional Neural Networks", "paper_year": 2012, "paper_venue": "NIPS", "paper_citations": 92, "paper_abstract": "We trained a large, deep convolutional neural network to classify the 1.2 million high-resolution images in the ImageNet LSVRC-2010 contest into the 1000 different classes. On the test data, we achieved top-1 and top-5 error rates of 37.5% and 17.0%, respectively, which is considerably better than the previous state-of-the-art. The neural network, which has 60 million parameters and 650,000 neurons, consists of five convolutional layers, some of which are followed by max-pooling layers, and three fully connected layers with a final 1000-way softmax. To make training faster, we used non-saturating neurons and a very efficient GPU implementation of the convolution operation. To reduce overfitting in the fully connected layers we employed a recently developed regularization method called \"dropout\" that proved to be very effective. We also entered a variant of this model in the ILSVRC-2012 competition and achieved a winning top-5 test error rate of 15.3%, compared to 26.2% achieved by the second-best entry.", "paper_authors": ["Alex Krizhevsky", "Ilya Sutskever", "Geoffrey E. Hinton"], "citations": ["2c03df8b48bf3fa39054345bafabfeff15bfd11d", "e74f9b7f8eec6ba4704c206b93bc8079af3da4bd", "081651b38ff7533550a3adfc1c00da333a8fe86c", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "39dba6f22d72853561a4ed684be265e179a39e4f", "272216c1f097706721096669d85b2843c23fa77d", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "061356704ec86334dbbc073985375fe13cd39088", "146f6f6ed688c905fb6e346ad02332efd5464616", "71b7178df5d2b112d07e45038cb5637208659ff7", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "0b544dfe355a5070b60986319a3f51fb45d1348e", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "references": ["38211dc39e41273c0007889202c69f841e02248a"], "score": 0.3759735225396589}, {"paper_id": "0a10d64beb0931efdc24a28edaa91d539194b2e2", "paper_title": "Efficient Estimation of Word Representations in Vector Space", "paper_year": 2013, "paper_venue": "ICLR", "paper_citations": 78, "paper_abstract": "We propose two novel model architectures for computing continuous vector representations of words from very large data sets. The quality of these representations is measured in a word similarity task, and the results are compared to the previously best performing techniques based on different types of neural networks. We observe large improvements in accuracy at much lower computational cost, i.e. it takes less than a day to learn high quality word vectors from a 1.6 billion words data set. Furthermore, we show that these vectors provide state-of-the-art performance on our test set for measuring syntactic and semantic word similarities.", "paper_authors": ["Tomas Mikolov", "Kai Chen", "Gregory S. Corrado", "Jeffrey Dean"], "citations": ["59761abc736397539bdd01ad7f9d91c8607c0457", "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "9784fbf77295860b2e412137b86356d70b25e3c0", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "e74f9b7f8eec6ba4704c206b93bc8079af3da4bd", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "bc1d609520290e0460c49b685675eb5a57fa5935", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "0e6824e137847be0599bb0032e37042ed2ef5045", "ac11062f1f368d97f4c826c317bf50dcc13fdb59"], "references": ["23694a80bf1b9b38215be3e23068dd75296bc90f"], "score": 0.5570194740329586}, {"paper_id": "6c8b30f63f265c32e26d999aa1fef5286b8308ad", "paper_title": "Dropout: a simple way to prevent neural networks from overfitting", "paper_year": 2014, "paper_venue": "J. Mach. Learn. Res.", "paper_citations": 74, "paper_abstract": "Deep neural nets with a large number of parameters are very powerful machine learning systems. However, overfitting is a serious problem in such networks. Large networks are also slow to use, making it difficult to deal with overfitting by combining the predictions of many different large neural nets at test time. Dropout is a technique for addressing this problem. The key idea is to randomly drop units (along with their connections) from the neural network during training. This prevents units from co-adapting too much. During training, dropout samples from an exponential number of different \"thinned\" networks. At test time, it is easy to approximate the effect of averaging the predictions of all these thinned networks by simply using a single unthinned network that has smaller weights. This significantly reduces overfitting and gives major improvements over other regularization methods. We show that dropout improves the performance of neural networks on supervised learning tasks in vision, speech recognition, document classification and computational biology, obtaining state-of-the-art results on many benchmark data sets.", "paper_authors": ["Nitish Srivastava", "Geoffrey E. Hinton", "Alex Krizhevsky", "Ilya Sutskever", "Ruslan Salakhutdinov"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "007ab5528b3bd310a80d553cccad4b78dc496b02", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "3febb2bed8865945e7fddc99efd791887bb7e14f", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "e0222a1ae6874f7fff128c3da8769ab95963da04", "146f6f6ed688c905fb6e346ad02332efd5464616", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "4361e64f2d12d63476fdc88faf72a0f70d9a2ffb"], "references": ["843959ffdccf31c6694d135fad07425924f785b1", "abd1c342495432171beb7ca8fd9551ef13cbd0ff"], "score": 0.5718024780708552}, {"paper_id": "2c03df8b48bf3fa39054345bafabfeff15bfd11d", "paper_title": "Deep Residual Learning for Image Recognition", "paper_year": 2015, "paper_venue": "2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR)", "paper_citations": 58, "paper_abstract": "Deeper neural networks are more difficult to train. We present a residual learning framework to ease the training of networks that are substantially deeper than those used previously. We explicitly reformulate the layers as learning residual functions with reference to the layer inputs, instead of learning unreferenced functions. We provide comprehensive empirical evidence showing that these residual networks are easier to optimize, and can gain accuracy from considerably increased depth. On the ImageNet dataset we evaluate residual nets with a depth of up to 152 layers - 8× deeper than VGG nets [40] but still having lower complexity. An ensemble of these residual nets achieves 3.57% error on the ImageNet test set. This result won the 1st place on the ILSVRC 2015 classification task. We also present analysis on CIFAR-10 with 100 and 1000 layers. The depth of representations is of central importance for many visual recognition tasks. Solely due to our extremely deep representations, we obtain a 28% relative improvement on the COCO object detection dataset. Deep residual nets are foundations of our submissions to ILSVRC & COCO 2015 competitions1, where we also won the 1st places on the tasks of ImageNet detection, ImageNet localization, COCO detection, and COCO segmentation.", "paper_authors": ["Kaiming He", "Xiangyu Zhang", "Shaoqing Ren", "Jian Sun"], "citations": ["1e077413b25c4d34945cc2707e17e46ed4fe784a", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "e0222a1ae6874f7fff128c3da8769ab95963da04", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "references": ["0b3cfbf79d50dae4a16584533227bb728e3522aa", "061356704ec86334dbbc073985375fe13cd39088", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "71b7178df5d2b112d07e45038cb5637208659ff7"], "score": 0.4765776646179331}, {"paper_id": "061356704ec86334dbbc073985375fe13cd39088", "paper_title": "Very Deep Convolutional Networks for Large-Scale Image Recognition", "paper_year": 2014, "paper_venue": "ICLR", "paper_citations": 54, "paper_abstract": "Abstract: In this work we investigate the effect of the convolutional network depth on its accuracy in the large-scale image recognition setting. Our main contribution is a thorough evaluation of networks of increasing depth using an architecture with very small (3x3) convolution filters, which shows that a significant improvement on the prior-art configurations can be achieved by pushing the depth to 16-19 weight layers. These findings were the basis of our ImageNet Challenge 2014 submission, where our team secured the first and the second places in the localisation and classification tracks respectively. We also show that our representations generalise well to other datasets, where they achieve state-of-the-art results. We have made our two best-performing ConvNet models publicly available to facilitate further research on the use of deep visual representations in computer vision.", "paper_authors": ["Karen Simonyan", "Andrew Zisserman"], "citations": ["2c03df8b48bf3fa39054345bafabfeff15bfd11d", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "e74f9b7f8eec6ba4704c206b93bc8079af3da4bd", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "146f6f6ed688c905fb6e346ad02332efd5464616", "4361e64f2d12d63476fdc88faf72a0f70d9a2ffb"], "references": ["38211dc39e41273c0007889202c69f841e02248a", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "e74f9b7f8eec6ba4704c206b93bc8079af3da4bd"], "score": 0.3599894091448029}, {"paper_id": "05aba481e8a221df5d8775a3bb749001e7f2525e", "paper_title": "Adaptive Subgradient Methods for Online Learning and Stochastic Optimization", "paper_year": 2010, "paper_venue": "COLT", "paper_citations": 46, "paper_abstract": "We present a new family of subgradient methods that dynamically incorporate knowledge of the geometry of the data observed in earlier iterations to perform more informative gradient-based learning. Metaphorically, the adaptation allows us to find needles in haystacks in the form of very predictive but rarely seen features. Our paradigm stems from recent advances in stochastic optimization and online learning which employ proximal functions to control the gradient steps of the algorithm. We describe and analyze an apparatus for adaptively modifying the proximal function, which significantly simplifies setting a learning rate and results in regret guarantees that are provably as good as the best proximal function that can be chosen in hindsight. We give several efficient algorithms for empirical risk minimization problems with common and important regularization functions and domain constraints. We experimentally study our theoretical analysis and show that adaptive subgradient methods outperform state-of-the-art, yet non-adaptive, subgradient algorithms.", "paper_authors": ["John C. Duchi", "Elad Hazan", "Yoram Singer"], "citations": ["4e88de2930a4435f737c3996287a90ff87b95c59", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "272216c1f097706721096669d85b2843c23fa77d", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "687bac2d3320083eb4530bf18bb8f8f721477600", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "references": ["38211dc39e41273c0007889202c69f841e02248a"], "score": 0.42678282829529746}, {"paper_id": "71b7178df5d2b112d07e45038cb5637208659ff7", "paper_title": "Microsoft COCO: Common Objects in Context", "paper_year": 2014, "paper_venue": "ECCV", "paper_citations": 37, "paper_abstract": "We present a new dataset with the goal of advancing the state-of-the-art in object recognition by placing the question of object recognition in the context of the broader question of scene understanding. This is achieved by gathering images of complex everyday scenes containing common objects in their natural context. Objects are labeled using per-instance segmentations to aid in precise object localization. Our dataset contains photos of 91 objects types that would be easily recognizable by a 4 year old. With a total of 2.5 million labeled instances in 328k images, the creation of our dataset drew upon extensive crowd worker involvement via novel user interfaces for category detection, instance spotting and instance segmentation. We present a detailed statistical analysis of the dataset in comparison to PASCAL, ImageNet, and SUN. Finally, we provide baseline performance analysis for bounding box and segmentation detection results using a Deformable Parts Model.", "paper_authors": ["Tsung-Yi Lin", "Michael Maire", "Serge J. Belongie", "James Hays", "Pietro Perona", "Deva Ramanan", "Piotr Dollár", "C. Lawrence Zitnick"], "citations": ["2c03df8b48bf3fa39054345bafabfeff15bfd11d", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "e74f9b7f8eec6ba4704c206b93bc8079af3da4bd", "bc1d609520290e0460c49b685675eb5a57fa5935", "0e6824e137847be0599bb0032e37042ed2ef5045", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "146f6f6ed688c905fb6e346ad02332efd5464616"], "references": ["38211dc39e41273c0007889202c69f841e02248a", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "d87ceda3042f781c341ac17109d1e94a717f5f60"], "score": 0.3486380158491925}, {"paper_id": "e74f9b7f8eec6ba4704c206b93bc8079af3da4bd", "paper_title": "ImageNet Large Scale Visual Recognition Challenge", "paper_year": 2014, "paper_venue": "International Journal of Computer Vision", "paper_citations": 23, "paper_abstract": "The ImageNet Large Scale Visual Recognition Challenge is a benchmark in object category classification and detection on hundreds of object categories and millions of images. The challenge has been run annually from 2010 to present, attracting participation from more than fifty institutions. This paper describes the creation of this benchmark dataset and the advances in object recognition that have been possible as a result. We discuss the challenges of collecting large-scale ground truth annotation, highlight key breakthroughs in categorical object recognition, provide a detailed analysis of the current state of the field of large-scale image classification and object detection, and compare the state-of-the-art computer vision accuracy with human accuracy. We conclude with lessons learned in the 5 years of the challenge, and propose future directions and improvements.", "paper_authors": ["Olga Russakovsky", "Jia Deng", "Hao Su", "Jonathan Krause", "Sanjeev Satheesh", "Sean Ma", "Zhiheng Huang", "Andrej Karpathy", "Aditya Khosla", "Michael S. Bernstein", "Alexander C. Berg", "Fei-Fei Li"], "citations": ["26e743d5bd465f49b9538deaf116c15e61b7951f", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "061356704ec86334dbbc073985375fe13cd39088"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "061356704ec86334dbbc073985375fe13cd39088", "71b7178df5d2b112d07e45038cb5637208659ff7", "38211dc39e41273c0007889202c69f841e02248a"], "score": 0.21621697683469832}]], [[{"paper_id": "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb", "paper_title": "Neural Network Acceptability Judgments", "paper_year": 2018, "paper_venue": "ArXiv", "paper_citations": 2, "paper_abstract": "In this work, we explore the ability of artificial neural networks to judge the grammatical acceptability of a sentence. Machine learning research of this kind is well placed to answer important open questions about the role of prior linguistic bias in language acquisition by providing a test for the Poverty of the Stimulus Argument. In service of this goal, we introduce the Corpus of Linguistic Acceptability (CoLA), a set of 10,657 English sentences labeled as grammatical or ungrammatical by expert linguists. We train several recurrent neural networks to do binary acceptability classification. These models set a baseline for the task. Error-analysis testing the models on specific grammatical phenomena reveals that they learn some systematic grammatical generalizations like subject-verb-object word order without any grammatical supervision. We find that neural sequence models show promise on the acceptability classification task. However, human-like performance across a wide range of grammatical constructions remains far off.", "paper_authors": ["Alex Warstadt", "Amanpreet Singh", "Samuel R. Bowman"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "93b8da28d006415866bf48f9a6e06b5242129195"], "references": ["93b8da28d006415866bf48f9a6e06b5242129195", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "39dba6f22d72853561a4ed684be265e179a39e4f", "3febb2bed8865945e7fddc99efd791887bb7e14f", "272216c1f097706721096669d85b2843c23fa77d", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "score": 1.5823063842565463}, {"paper_id": "0e6824e137847be0599bb0032e37042ed2ef5045", "paper_title": "Aligning Books and Movies: Towards Story-Like Visual Explanations by Watching Movies and Reading Books", "paper_year": 2015, "paper_venue": "2015 IEEE International Conference on Computer Vision (ICCV)", "paper_citations": 18, "paper_abstract": "Books are a rich source of both fine-grained information, how a character, an object or a scene looks like, as well as high-level semantics, what someone is thinking, feeling and how these states evolve through a story. This paper aims to align books to their movie releases in order to provide rich descriptive explanations for visual content that go semantically far beyond the captions available in the current datasets. To align movies and books we propose a neural sentence embedding that is trained in an unsupervised way from a large corpus of books, as well as a video-text neural embedding for computing similarities between movie clips and sentences in the book. We propose a context-aware CNN to combine information from multiple sources. We demonstrate good quantitative performance for movie/book alignment and show several qualitative examples that showcase the diversity of tasks our model can be used for.", "paper_authors": ["Yukun Zhu", "Ryan Kiros", "Richard S. Zemel", "Ruslan Salakhutdinov", "Raquel Urtasun", "Antonio Torralba", "Sanja Fidler"], "citations": ["6e795c6e9916174ae12349f5dc3f516570c17ce8", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "071b16f25117fb6133480c6259227d54fc2a5ea0", "d7da009f457917aa381619facfa5ffae9329a6e9", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "39dba6f22d72853561a4ed684be265e179a39e4f", "272216c1f097706721096669d85b2843c23fa77d", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "146f6f6ed688c905fb6e346ad02332efd5464616", "71b7178df5d2b112d07e45038cb5637208659ff7", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "score": 1.5005213818806258}, {"paper_id": "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "paper_title": "Google's Neural Machine Translation System: Bridging the Gap between Human and Machine Translation", "paper_year": 2016, "paper_venue": "ArXiv", "paper_citations": 17, "paper_abstract": "Neural Machine Translation (NMT) is an end-to-end learning approach for automated translation, with the potential to overcome many of the weaknesses of conventional phrase-based translation systems. Unfortunately, NMT systems are known to be computationally expensive both in training and in translation inference. Also, most NMT systems have difficulty with rare words. These issues have hindered NMT's use in practical deployments and services, where both accuracy and speed are essential. In this work, we present GNMT, Google's Neural Machine Translation system, which attempts to address many of these issues. Our model consists of a deep LSTM network with 8 encoder and 8 decoder layers using attention and residual connections. To improve parallelism and therefore decrease training time, our attention mechanism connects the bottom layer of the decoder to the top layer of the encoder. To accelerate the final translation speed, we employ low-precision arithmetic during inference computations. To improve handling of rare words, we divide words into a limited set of common sub-word units (\"wordpieces\") for both input and output. This method provides a good balance between the flexibility of \"character\"-delimited models and the efficiency of \"word\"-delimited models, naturally handles translation of rare words, and ultimately improves the overall accuracy of the system. Our beam search technique employs a length-normalization procedure and uses a coverage penalty, which encourages generation of an output sentence that is most likely to cover all the words in the source sentence. On the WMT'14 English-to-French and English-to-German benchmarks, GNMT achieves competitive results to state-of-the-art. Using a human side-by-side evaluation on a set of isolated simple sentences, it reduces translation errors by an average of 60% compared to Google's phrase-based production system.", "paper_authors": ["Yonghui Wu", "Mike Schuster", "Zhifeng Chen", "Quoc V. Le", "Mohammad Norouzi", "Wolfgang Macherey", "Maxim Krikun", "Yuan Cao", "Qin Gao", "Klaus Macherey", "Jeff Klingner", "Apurva Shah", "Melvin Johnson", "Xiaobing Liu", "Lukasz Kaiser", "Stephan Gouws", "Yoshikiyo Kato", "Taku Kudo", "Hideto Kazawa", "Keith Stevens", "George Kurian", "Nishant Patil", "Wei Wang", "Cliff Young", "Jason Smith", "Jason Riesa", "Alex Rudnick", "Oriol Vinyals", "Gregory S. Corrado", "Macduff Hughes", "Jeffrey Dean"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "references": ["2c03df8b48bf3fa39054345bafabfeff15bfd11d", "071b16f25117fb6133480c6259227d54fc2a5ea0", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "39dba6f22d72853561a4ed684be265e179a39e4f", "272216c1f097706721096669d85b2843c23fa77d", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "93499a7c7f699b6630a86fad964536f9423bb6d0", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "score": 1.4441816231626947}, {"paper_id": "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "paper_title": "Attention Is All You Need", "paper_year": 2017, "paper_venue": "NIPS", "paper_citations": 24, "paper_abstract": "The dominant sequence transduction models are based on complex recurrent orconvolutional neural networks in an encoder and decoder configuration. The best performing such models also connect the encoder and decoder through an attentionm echanisms. We propose a novel, simple network architecture based solely onan attention mechanism, dispensing with recurrence and convolutions entirely.Experiments on two machine translation tasks show these models to be superiorin quality while being more parallelizable and requiring significantly less timeto train. Our single model with 165 million parameters, achieves 27.5 BLEU onEnglish-to-German translation, improving over the existing best ensemble result by over 1 BLEU. On English-to-French translation, we outperform the previoussingle state-of-the-art with model by 0.7 BLEU, achieving a BLEU score of 41.1.", "paper_authors": ["Ashish Vaswani", "Noam Shazeer", "Niki Parmar", "Jakob Uszkoreit", "Llion Jones", "Aidan N. Gomez", "Lukasz Kaiser", "Illia Polosukhin"], "citations": ["93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "b9de9599d7241459db9213b5cdd7059696f5ef8d", "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d"], "references": ["2c03df8b48bf3fa39054345bafabfeff15bfd11d", "071b16f25117fb6133480c6259227d54fc2a5ea0", "6c8b30f63f265c32e26d999aa1fef5286b8308ad", "47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "39dba6f22d72853561a4ed684be265e179a39e4f", "272216c1f097706721096669d85b2843c23fa77d", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "93499a7c7f699b6630a86fad964536f9423bb6d0", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "0b544dfe355a5070b60986319a3f51fb45d1348e", "652d159bf64a70194127722d19841daa99a69b64"], "score": 1.5711933791106922}, {"paper_id": "b9de9599d7241459db9213b5cdd7059696f5ef8d", "paper_title": "Character-Level Language Modeling with Deeper Self-Attention", "paper_year": 2018, "paper_venue": "AAAI", "paper_citations": 1, "paper_abstract": "LSTMs and other RNN variants have shown strong performance on character-level language modeling. These models are typically trained using truncated backpropagation through time, and it is common to assume that their success stems from their ability to remember long-term contexts. In this paper, we show that a deep (64-layer) transformer model with fixed context outperforms RNN variants by a large margin, achieving state of the art on two popular benchmarks: 1.13 bits per character on text8 and 1.06 on enwik8. To get good results at this depth, we show that it is important to add auxiliary losses, both at intermediate network layers and intermediate sequence positions.", "paper_authors": ["Rami Al-Rfou", "Dokook Choe", "Noah Constant", "Mandy Guo", "Llion Jones"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": ["5d833331b0e22ff359db05c62a8bca18c4f04b68", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "23694a80bf1b9b38215be3e23068dd75296bc90f", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "score": 1.4582014951764941}, {"paper_id": "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d", "paper_title": "MaskGAN: Better Text Generation via Filling in the _______", "paper_year": 2018, "paper_venue": "ICLR", "paper_citations": 1, "paper_abstract": "Neural text generation models are often autoregressive language models or seq2seq models. Neural autoregressive and seq2seq models that generate text by sampling words sequentially, with each word conditioned on the previous model, are state-of-the-art for several machine translation and summarization benchmarks. These benchmarks are often defined by validation perplexity even though this is not a direct measure of sample quality. Language models are typically trained via maximum likelihood and most often with teacher forcing. Teacher forcing is well-suited to optimizing perplexity but can result in poor sample quality because generating text requires conditioning on sequences of words that were never observed at training time. We propose to improve sample quality using Generative Adversarial Network (GANs), which explicitly train the generator to produce high quality samples and have shown a lot of success in image generation. GANs were originally to designed to output differentiable values, so discrete language generation is challenging for them. We introduce an actor-critic conditional GAN that fills in missing text conditioned on the surrounding context. We show qualitatively and quantitatively, evidence that this produces more realistic text samples compared to a maximum likelihood trained model.", "paper_authors": ["William Fedus", "Ian J. Goodfellow", "Andrew M. Dai"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": ["d7da009f457917aa381619facfa5ffae9329a6e9", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "39dba6f22d72853561a4ed684be265e179a39e4f", "272216c1f097706721096669d85b2843c23fa77d", "23694a80bf1b9b38215be3e23068dd75296bc90f", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "93499a7c7f699b6630a86fad964536f9423bb6d0", "0b44fcbeea9415d400c5f5789d6b892b6f98daff"], "score": 1.448164780007459}], [{"paper_id": "0b3cfbf79d50dae4a16584533227bb728e3522aa", "paper_title": "Long Short-Term Memory", "paper_year": 1997, "paper_venue": "Neural Computation", "paper_citations": 206, "paper_abstract": "Learning to store information over extended time intervals by recurrent backpropagation takes a very long time, mostly because of insufficient, decaying error backflow. We briefly review Hochreiter's (1991) analysis of this problem, then address it by introducing a novel, efficient, gradient based method called long short-term memory (LSTM). Truncating the gradient where this does not do harm, LSTM can learn to bridge minimal time lags in excess of 1000 discrete-time steps by enforcing constant error flow through constant error carousels within special units. Multiplicative gate units learn to open and close access to the constant error flow. LSTM is local in space and time; its computational complexity per time step and weight is O. 1. Our experiments with artificial data involve local, distributed, real-valued, and noisy pattern representations. In comparisons with real-time recurrent learning, back propagation through time, recurrent cascade correlation, Elman nets, and neural sequence chunking, LSTM leads to many more successful runs, and learns much faster. LSTM also solves complex, artificial long-time-lag tasks that have never been solved by previous recurrent network algorithms.", "paper_authors": ["Sepp Hochreiter", "Jürgen Schmidhuber"], "citations": ["007ab5528b3bd310a80d553cccad4b78dc496b02", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292", "39dba6f22d72853561a4ed684be265e179a39e4f", "4e88de2930a4435f737c3996287a90ff87b95c59", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb", "2c03df8b48bf3fa39054345bafabfeff15bfd11d", "071b16f25117fb6133480c6259227d54fc2a5ea0", "9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "146f6f6ed688c905fb6e346ad02332efd5464616", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "652d159bf64a70194127722d19841daa99a69b64", "27e98e09cf09bc13c913d01676e5f32624011050", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "421fc2556836a6b441de806d7b393a35b6eaea58", "0e6824e137847be0599bb0032e37042ed2ef5045", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "b9de9599d7241459db9213b5cdd7059696f5ef8d", "d1505c6123c102e53eb19dff312cb25cea840b72", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "references": [], "score": 0.6832696846102563}, {"paper_id": "071b16f25117fb6133480c6259227d54fc2a5ea0", "paper_title": "Neural Machine Translation by Jointly Learning to Align and Translate", "paper_year": 2014, "paper_venue": "ICLR", "paper_citations": 151, "paper_abstract": "Abstract: Neural machine translation is a recently proposed approach to machine translation. Unlike the traditional statistical machine translation, the neural machine translation aims at building a single neural network that can be jointly tuned to maximize the translation performance. The models proposed recently for neural machine translation often belong to a family of encoder-decoders and consists of an encoder that encodes a source sentence into a fixed-length vector from which a decoder generates a translation. In this paper, we conjecture that the use of a fixed-length vector is a bottleneck in improving the performance of this basic encoder-decoder architecture, and propose to extend this by allowing a model to automatically (soft-)search for parts of a source sentence that are relevant to predicting a target word, without having to form these parts as a hard segment explicitly. With this new approach, we achieve a translation performance comparable to the existing state-of-the-art phrase-based system on the task of English-to-French translation. Furthermore, qualitative analysis reveals that the (soft-)alignments found by the model agree well with our intuition.", "paper_authors": ["Dzmitry Bahdanau", "Kyunghyun Cho", "Yoshua Bengio"], "citations": ["007ab5528b3bd310a80d553cccad4b78dc496b02", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "39dba6f22d72853561a4ed684be265e179a39e4f", "4e88de2930a4435f737c3996287a90ff87b95c59", "93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "146f6f6ed688c905fb6e346ad02332efd5464616", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "27e98e09cf09bc13c913d01676e5f32624011050", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "e0222a1ae6874f7fff128c3da8769ab95963da04", "47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "0e6824e137847be0599bb0032e37042ed2ef5045", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "93499a7c7f699b6630a86fad964536f9423bb6d0", "d1505c6123c102e53eb19dff312cb25cea840b72", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "references": ["944a1cfd79dbfb6fef460360a0765ba790f4027a", "39dba6f22d72853561a4ed684be265e179a39e4f", "23694a80bf1b9b38215be3e23068dd75296bc90f", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "0b544dfe355a5070b60986319a3f51fb45d1348e", "652d159bf64a70194127722d19841daa99a69b64"], "score": 0.5505805521360444}, {"paper_id": "39dba6f22d72853561a4ed684be265e179a39e4f", "paper_title": "Sequence to Sequence Learning with Neural Networks", "paper_year": 2014, "paper_venue": "NIPS", "paper_citations": 128, "paper_abstract": "Deep Neural Networks (DNNs) are powerful models that have achieved excellent performance on difficult learning tasks. Although DNNs work well whenever large labeled training sets are available, they cannot be used to map sequences to sequences. In this paper, we present a general end-to-end approach to sequence learning that makes minimal assumptions on the sequence structure. Our method uses a multilayered Long Short-Term Memory (LSTM) to map the input sequence to a vector of a fixed dimensionality, and then another deep LSTM to decode the target sequence from the vector. Our main result is that on an English to French translation task from the WMT'14 dataset, the translations produced by the LSTM achieve a BLEU score of 34.8 on the entire test set, where the LSTM's BLEU score was penalized on out-of-vocabulary words. Additionally, the LSTM did not have difficulty on long sentences. For comparison, a phrase-based SMT system achieves a BLEU score of 33.3 on the same dataset. When we used the LSTM to rerank the 1000 hypotheses produced by the aforementioned SMT system, its BLEU score increases to 36.5, which is close to the previous best result on this task. The LSTM also learned sensible phrase and sentence representations that are sensitive to word order and are relatively invariant to the active and the passive voice. Finally, we found that reversing the order of the words in all source sentences (but not target sentences) improved the LSTM's performance markedly, because doing so introduced many short term dependencies between the source and the target sentence which made the optimization problem easier.", "paper_authors": ["Ilya Sutskever", "Oriol Vinyals", "Quoc V. Le"], "citations": ["6e795c6e9916174ae12349f5dc3f516570c17ce8", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "4e88de2930a4435f737c3996287a90ff87b95c59", "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb", "26e743d5bd465f49b9538deaf116c15e61b7951f", "071b16f25117fb6133480c6259227d54fc2a5ea0", "9784fbf77295860b2e412137b86356d70b25e3c0", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "146f6f6ed688c905fb6e346ad02332efd5464616", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "421fc2556836a6b441de806d7b393a35b6eaea58", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "0e6824e137847be0599bb0032e37042ed2ef5045", "93499a7c7f699b6630a86fad964536f9423bb6d0", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "references": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "d7da009f457917aa381619facfa5ffae9329a6e9", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "162d958ff885f1462aeda91cd72582323fd6a1f4", "23694a80bf1b9b38215be3e23068dd75296bc90f", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "0b544dfe355a5070b60986319a3f51fb45d1348e", "652d159bf64a70194127722d19841daa99a69b64"], "score": 0.574082318336826}, {"paper_id": "272216c1f097706721096669d85b2843c23fa77d", "paper_title": "Adam: A Method for Stochastic Optimization", "paper_year": 2014, "paper_venue": "ICLR", "paper_citations": 135, "paper_abstract": "Abstract: We introduce Adam, an algorithm for first-order gradient-based optimization of stochastic objective functions, based on adaptive estimates of lower-order moments. The method is straightforward to implement, is computationally efficient, has little memory requirements, is invariant to diagonal rescaling of the gradients, and is well suited for problems that are large in terms of data and/or parameters. The method is also appropriate for non-stationary objectives and problems with very noisy and/or sparse gradients. The hyper-parameters have intuitive interpretations and typically require little tuning. Some connections to related algorithms, on which Adam was inspired, are discussed. We also analyze the theoretical convergence properties of the algorithm and provide a regret bound on the convergence rate that is comparable to the best known results under the online convex optimization framework. Empirical results demonstrate that Adam works well in practice and compares favorably to other stochastic optimization methods. Finally, we discuss AdaMax, a variant of Adam based on the infinity norm.", "paper_authors": ["Diederik P. Kingma", "Jimmy Ba"], "citations": ["6e795c6e9916174ae12349f5dc3f516570c17ce8", "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb", "4361e64f2d12d63476fdc88faf72a0f70d9a2ffb", "93b8da28d006415866bf48f9a6e06b5242129195", "8c1b00128e74f1cd92aede3959690615695d5101", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "146f6f6ed688c905fb6e346ad02332efd5464616", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "27e98e09cf09bc13c913d01676e5f32624011050", "3febb2bed8865945e7fddc99efd791887bb7e14f", "e0222a1ae6874f7fff128c3da8769ab95963da04", "59761abc736397539bdd01ad7f9d91c8607c0457", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "0e6824e137847be0599bb0032e37042ed2ef5045", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "references": ["652d159bf64a70194127722d19841daa99a69b64", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "05aba481e8a221df5d8775a3bb749001e7f2525e"], "score": 0.6802510464582773}, {"paper_id": "0b544dfe355a5070b60986319a3f51fb45d1348e", "paper_title": "Learning Phrase Representations using RNN Encoder-Decoder for Statistical Machine Translation", "paper_year": 2014, "paper_venue": "EMNLP", "paper_citations": 96, "paper_abstract": "In this paper, we propose a novel neural network model called RNN Encoder-Decoder that consists of two recurrent neural networks (RNN). One RNN encodes a sequence of symbols into a fixed-length vector representation, and the other decodes the representation into another sequence of symbols. The encoder and decoder of the proposed model are jointly trained to maximize the conditional probability of a target sequence given a source sequence. The performance of a statistical machine translation system is empirically found to improve by using the conditional probabilities of phrase pairs computed by the RNN Encoder-Decoder as an additional feature in the existing log-linear model. Qualitatively, we show that the proposed model learns a semantically and syntactically meaningful representation of linguistic phrases.", "paper_authors": ["Kyunghyun Cho", "Bart van Merrienboer", "Çaglar Gülçehre", "Dzmitry Bahdanau", "Fethi Bougares", "Holger Schwenk", "Yoshua Bengio"], "citations": ["26e743d5bd465f49b9538deaf116c15e61b7951f", "071b16f25117fb6133480c6259227d54fc2a5ea0", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "39dba6f22d72853561a4ed684be265e179a39e4f", "b1e20420982a4f923c08652941666b189b11b7fe", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "0e6824e137847be0599bb0032e37042ed2ef5045", "3c78c6df5eb1695b6a399e346dde880af27d1016", "146f6f6ed688c905fb6e346ad02332efd5464616", "93499a7c7f699b6630a86fad964536f9423bb6d0", "b9de9599d7241459db9213b5cdd7059696f5ef8d", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb"], "references": ["87f40e6f3022adbc1f1905e3e506abad05a9964f", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "23694a80bf1b9b38215be3e23068dd75296bc90f", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "ae5e6c6f5513613a161b2c85563f9708bf2e9178"], "score": 0.5710462318049099}, {"paper_id": "47a87c2cbdd928bb081974d308b3d9cf678d257e", "paper_title": "Recurrent neural network based language model", "paper_year": 2010, "paper_venue": "INTERSPEECH", "paper_citations": 71, "paper_abstract": "A new recurrent neural network based language model (RNN LM) with applications to speech recognition is presented. Results indicate that it is possible to obtain around 50% reduction of perplexity by using mixture of several RNN LMs, compared to a state of the art backoff language model. Speech recognition experiments show around 18% reduction of word error rate on the Wall Street Journal task when comparing models trained on the same amount of data, and around 5% on the much harder NIST RT05 task, even when the backoff model is trained on much more data than the RNN LM. We provide ample empirical evidence to suggest that connectionist language models are superior to standard n-gram techniques, except their high computational (training) complexity. Index Terms: language modeling, recurrent neural networks, speech recognition", "paper_authors": ["Tomas Mikolov", "Martin Karafiát", "Lukás Burget", "Jan Černocký", "Sanjeev Khudanpur"], "citations": ["944a1cfd79dbfb6fef460360a0765ba790f4027a", "5d833331b0e22ff359db05c62a8bca18c4f04b68", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "39dba6f22d72853561a4ed684be265e179a39e4f", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "b9de9599d7241459db9213b5cdd7059696f5ef8d", "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "references": ["23694a80bf1b9b38215be3e23068dd75296bc90f"], "score": 0.4743561379344041}, {"paper_id": "d7da009f457917aa381619facfa5ffae9329a6e9", "paper_title": "Bleu: a Method for Automatic Evaluation of Machine Translation", "paper_year": 2001, "paper_venue": "ACL", "paper_citations": 53, "paper_abstract": "Human evaluations of machine translation are extensive but expensive. Human evaluations can take months to finish and involve human labor that can not be reused. We propose a method of automatic machine translation evaluation that is quick, inexpensive, and language-independent, that correlates highly with human evaluation, and that has little marginal cost per run. We present this method as an automated understudy to skilled human judges which substitutes for them when there is need for quick or frequent evaluations.", "paper_authors": ["Kishore Papineni", "Salim Roukos", "Todd Ward", "Wei-Jing Zhu"], "citations": ["9784fbf77295860b2e412137b86356d70b25e3c0", "39dba6f22d72853561a4ed684be265e179a39e4f", "0e6824e137847be0599bb0032e37042ed2ef5045", "93499a7c7f699b6630a86fad964536f9423bb6d0", "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d"], "references": [], "score": 0.348864338065062}, {"paper_id": "944a1cfd79dbfb6fef460360a0765ba790f4027a", "paper_title": "Recurrent Continuous Translation Models", "paper_year": 2013, "paper_venue": "EMNLP", "paper_citations": 48, "paper_abstract": "We introduce a class of probabilistic continuous translation models called Recurrent Continuous Translation Models that are purely based on continuous representations for words, phrases and sentences and do not rely on alignments or phrasal translation units. The models have a generation and a conditioning aspect. The generation of the translation is modelled with a target Recurrent Language Model, whereas the conditioning on the source sentence is modelled with a Convolutional Sentence Model. Through various experiments, we show first that our models obtain a perplexity with respect to gold translations that is > 43% lower than that of stateof-the-art alignment-based translation models. Secondly, we show that they are remarkably sensitive to the word order, syntax, and meaning of the source sentence despite lacking alignments. Finally we show that they match a state-of-the-art system when rescoring n-best lists of translations.", "paper_authors": ["Nal Kalchbrenner", "Phil Blunsom"], "citations": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "39dba6f22d72853561a4ed684be265e179a39e4f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "0e6824e137847be0599bb0032e37042ed2ef5045", "146f6f6ed688c905fb6e346ad02332efd5464616", "93499a7c7f699b6630a86fad964536f9423bb6d0", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "references": ["23694a80bf1b9b38215be3e23068dd75296bc90f", "1a07186bc10592f0330655519ad91652125cd907", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "05aba481e8a221df5d8775a3bb749001e7f2525e", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "27e38351e48fe4b7da2775bf94341738bc4da07e"], "score": 0.431737672677941}, {"paper_id": "146f6f6ed688c905fb6e346ad02332efd5464616", "paper_title": "Show, Attend and Tell: Neural Image Caption Generation with Visual Attention", "paper_year": 2015, "paper_venue": "ICML", "paper_citations": 39, "paper_abstract": "Inspired by recent work in machine translation and object detection, we introduce an attention based model that automatically learns to describe the content of images. We describe how we can train this model in a deterministic manner using standard backpropagation techniques and stochastically by maximizing a variational lower bound. We also show through visualization how the model is able to automatically learn to fix its gaze on salient objects while generating the corresponding words in the output sequence. We validate the use of attention with state-of-the-art performance on three benchmark datasets: Flickr8k, Flickr30k and MS COCO.", "paper_authors": ["Kelvin Xu", "Jimmy Ba", "Ryan Kiros", "Kyunghyun Cho", "Aaron C. Courville", "Ruslan Salakhutdinov", "Richard S. Zemel", "Yoshua Bengio"], "citations": ["f010affab57b5fcf1cd6be23df79d8ec98c7289c", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "0e6824e137847be0599bb0032e37042ed2ef5045", "93499a7c7f699b6630a86fad964536f9423bb6d0"], "references": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "6c8b30f63f265c32e26d999aa1fef5286b8308ad", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "39dba6f22d72853561a4ed684be265e179a39e4f", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "272216c1f097706721096669d85b2843c23fa77d", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "061356704ec86334dbbc073985375fe13cd39088", "71b7178df5d2b112d07e45038cb5637208659ff7", "0b544dfe355a5070b60986319a3f51fb45d1348e", "652d159bf64a70194127722d19841daa99a69b64"], "score": 0.3396819057788737}, {"paper_id": "652d159bf64a70194127722d19841daa99a69b64", "paper_title": "Generating Sequences With Recurrent Neural Networks", "paper_year": 2013, "paper_venue": "ArXiv", "paper_citations": 47, "paper_abstract": "This paper shows how Long Short-term Memory recurrent neural networks can be used to generate complex sequences with long-range structure, simply by predicting one data point at a time. The approach is demonstrated for text (where the data are discrete) and online handwriting (where the data are real-valued). It is then extended to handwriting synthesis by allowing the network to condition its predictions on a text sequence. The resulting system is able to generate highly realistic cursive handwriting in a wide variety of styles.", "paper_authors": ["Alex Graves"], "citations": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "39dba6f22d72853561a4ed684be265e179a39e4f", "272216c1f097706721096669d85b2843c23fa77d", "421fc2556836a6b441de806d7b393a35b6eaea58", "146f6f6ed688c905fb6e346ad02332efd5464616", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "references": ["0b3cfbf79d50dae4a16584533227bb728e3522aa", "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "1005645c05585c2042e3410daeed638b55e2474d"], "score": 0.383909080832399}, {"paper_id": "93499a7c7f699b6630a86fad964536f9423bb6d0", "paper_title": "Effective Approaches to Attention-based Neural Machine Translation", "paper_year": 2015, "paper_venue": "EMNLP", "paper_citations": 41, "paper_abstract": "An attentional mechanism has lately been used to improve neural machine translation (NMT) by selectively focusing on parts of the source sentence during translation. However, there has been little work exploring useful architectures for attention-based NMT. This paper examines two simple and effective classes of attentional mechanism: a global approach which always attends to all source words and a local one that only looks at a subset of source words at a time. We demonstrate the effectiveness of both approaches over the WMT translation tasks between English and German in both directions. With local attention, we achieve a significant gain of 5.0 BLEU points over non-attentional systems which already incorporate known techniques such as dropout. Our ensemble model using different attention architectures has established a new state-of-the-art result in the WMT'15 English to German translation task with 25.9 BLEU points, an improvement of 1.0 BLEU points over the existing best system backed by NMT and an n-gram reranker.", "paper_authors": ["Thang Luong", "Hieu Pham", "Christopher D. Manning"], "citations": ["9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "b1e20420982a4f923c08652941666b189b11b7fe", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "dbde7dfa6cae81df8ac19ef500c42db96c3d1edd", "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "references": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "d7da009f457917aa381619facfa5ffae9329a6e9", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "39dba6f22d72853561a4ed684be265e179a39e4f", "146f6f6ed688c905fb6e346ad02332efd5464616", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "score": 0.4604177089615182}, {"paper_id": "47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "paper_title": "Grammar as a Foreign Language", "paper_year": 2014, "paper_venue": "NIPS", "paper_citations": 31, "paper_abstract": "Syntactic constituency parsing is a fundamental problem in natural language processing and has been the subject of intensive research and engineering for decades. As a result, the most accurate parsers are domain specific, complex, and inefficient. In this paper we show that the domain agnostic attention-enhanced sequence-to-sequence model achieves state-of-the-art results on the most widely used syntactic constituency parsing dataset, when trained on a large synthetic corpus that was annotated using existing parsers. It also matches the performance of standard parsers when trained only on a small human-annotated dataset, which shows that this model is highly data-efficient, in contrast to sequence-to-sequence models without the attention mechanism. Our parser is also fast, processing over a hundred sentences per second with an unoptimized CPU implementation.", "paper_authors": ["Oriol Vinyals", "Lukasz Kaiser", "Terry K Koo", "Slav Petrov", "Ilya Sutskever", "Geoffrey E. Hinton"], "citations": ["204e3073870fae3d05bcbc2f6a8e263d9b72e776", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "071b16f25117fb6133480c6259227d54fc2a5ea0", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "39dba6f22d72853561a4ed684be265e179a39e4f", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "652d159bf64a70194127722d19841daa99a69b64"], "score": 0.3284511803178742}]], [[{"paper_id": "dac72f2c509aee67524d3321f77e97e8eff51de6", "paper_title": "Word Representations: A Simple and General Method for Semi-Supervised Learning", "paper_year": 2010, "paper_venue": "ACL", "paper_citations": 52, "paper_abstract": "If we take an existing supervised NLP system, a simple and general way to improve accuracy is to use unsupervised word representations as extra word features. We evaluate Brown clusters, Collobert and Weston (2008) embeddings, and HLBL (Mnih & Hinton, 2009) embeddings of words on both NER and chunking. We use near state-of-the-art supervised baselines, and find that each of the three word representations improves the accuracy of these baselines. We find further improvements by combining different word representations. You can download our word features, for off-the-shelf use in existing NLP systems, as well as our code, here: http://metaoptimize.com/projects/wordreprs/", "paper_authors": ["Joseph P. Turian", "Lev-Arie Ratinov", "Yoshua Bengio"], "citations": ["87f40e6f3022adbc1f1905e3e506abad05a9964f", "59761abc736397539bdd01ad7f9d91c8607c0457", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "1510cf4b8abea80b9f352325ca4c132887de21a0", "cfa2646776405d50533055ceb1b7f050e9014dcb", "3febb2bed8865945e7fddc99efd791887bb7e14f", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "4e88de2930a4435f737c3996287a90ff87b95c59", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "references": ["23694a80bf1b9b38215be3e23068dd75296bc90f", "783480acff435bfbc15ffcdb4f15eccddaa0c810", "1a07186bc10592f0330655519ad91652125cd907", "3a0e788268fafb23ab20da0e98bb578b06830f7d", "1005645c05585c2042e3410daeed638b55e2474d"], "score": 1.6158802747722711}, {"paper_id": "687bac2d3320083eb4530bf18bb8f8f721477600", "paper_title": "Recursive Deep Models for Semantic Compositionality Over a Sentiment Treebank", "paper_year": 2013, "paper_venue": "EMNLP", "paper_citations": 58, "paper_abstract": "Semantic word spaces have been very useful but cannot express the meaning of longer phrases in a principled way. Further progress towards understanding compositionality in tasks such as sentiment detection requires richer supervised training and evaluation resources and more powerful models of composition. To remedy this, we introduce a Sentiment Treebank. It includes fine grained sentiment labels for 215,154 phrases in the parse trees of 11,855 sentences and presents new challenges for sentiment compositionality. To address them, we introduce the Recursive Neural Tensor Network. When trained on the new treebank, this model outperforms all previous methods on several metrics. It pushes the state of the art in single sentence positive/negative classification from 80% up to 85.4%. The accuracy of predicting fine-grained sentiment labels for all phrases reaches 80.7%, an improvement of 9.7% over bag of features baselines. Lastly, it is the only model that can accurately capture the effects of negation and its scope at various tree levels for both positive and negative phrases.", "paper_authors": ["Richard Socher", "Alex Perelygin", "Jean Wu", "Jason Chuang", "Christopher D. Manning", "Andrew Y. Ng", "Christopher Potts"], "citations": ["f04df4e20a18358ea2f689b4c129781628ef7fc1", "93b8da28d006415866bf48f9a6e06b5242129195", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "9784fbf77295860b2e412137b86356d70b25e3c0", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "3febb2bed8865945e7fddc99efd791887bb7e14f", "bc1d609520290e0460c49b685675eb5a57fa5935", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "4e88de2930a4435f737c3996287a90ff87b95c59", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "references": ["cfa2646776405d50533055ceb1b7f050e9014dcb", "23694a80bf1b9b38215be3e23068dd75296bc90f", "1a07186bc10592f0330655519ad91652125cd907", "3a0e788268fafb23ab20da0e98bb578b06830f7d", "05aba481e8a221df5d8775a3bb749001e7f2525e", "745d86adca56ec50761591733e157f84cfb19671", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "27e38351e48fe4b7da2775bf94341738bc4da07e"], "score": 1.6257097257971682}, {"paper_id": "1a07186bc10592f0330655519ad91652125cd907", "paper_title": "A unified architecture for natural language processing: deep neural networks with multitask learning", "paper_year": 2008, "paper_venue": "ICML", "paper_citations": 78, "paper_abstract": "We describe a single convolutional neural network architecture that, given a sentence, outputs a host of language processing predictions: part-of-speech tags, chunks, named entity tags, semantic roles, semantically similar words and the likelihood that the sentence makes sense (grammatically and semantically) using a language model. The entire network is trained jointly on all these tasks using weight-sharing, an instance of multitask learning. All the tasks use labeled data except the language model which is learnt from unlabeled text and represents a novel form of semi-supervised learning for the shared tasks. We show how both multitask learning and semi-supervised learning improve the generalization of the shared tasks, resulting in state-of-the-art-performance.", "paper_authors": ["Ronan Collobert", "Jason Weston"], "citations": ["944a1cfd79dbfb6fef460360a0765ba790f4027a", "cfa2646776405d50533055ceb1b7f050e9014dcb", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "0d67362a5630ec3b7562327acc278c1c996454b5", "9784fbf77295860b2e412137b86356d70b25e3c0", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "3a0e788268fafb23ab20da0e98bb578b06830f7d", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "687bac2d3320083eb4530bf18bb8f8f721477600", "dac72f2c509aee67524d3321f77e97e8eff51de6", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "27e38351e48fe4b7da2775bf94341738bc4da07e"], "references": ["2c5135a0531bc5ad7dd890f018e67a40529f5bcb", "162d958ff885f1462aeda91cd72582323fd6a1f4", "23694a80bf1b9b38215be3e23068dd75296bc90f"], "score": 1.5382886400884224}, {"paper_id": "6e795c6e9916174ae12349f5dc3f516570c17ce8", "paper_title": "Skip-Thought Vectors", "paper_year": 2015, "paper_venue": "NIPS", "paper_citations": 42, "paper_abstract": "We describe an approach for unsupervised learning of a generic, distributed sentence encoder. Using the continuity of text from books, we train an encoder-decoder model that tries to reconstruct the surrounding sentences of an encoded passage. Sentences that share semantic and syntactic properties are thus mapped to similar vector representations. We next introduce a simple vocabulary expansion method to encode words that were not seen as part of training, allowing us to expand our vocabulary to a million words. After training our model, we extract and evaluate our vectors with linear models on 8 tasks: semantic relatedness, paraphrase detection, image-sentence ranking, question-type classification and 4 benchmark sentiment and subjectivity datasets. The end result is an off-the-shelf encoder that can produce highly generic sentence representations that are robust and perform well in practice. We will make our encoder publicly available.", "paper_authors": ["Ryan Kiros", "Yukun Zhu", "Ruslan Salakhutdinov", "Richard S. Zemel", "Raquel Urtasun", "Antonio Torralba", "Sanja Fidler"], "citations": ["59761abc736397539bdd01ad7f9d91c8607c0457", "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "bc1d609520290e0460c49b685675eb5a57fa5935", "0e6824e137847be0599bb0032e37042ed2ef5045", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "071b16f25117fb6133480c6259227d54fc2a5ea0", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "1510cf4b8abea80b9f352325ca4c132887de21a0", "39dba6f22d72853561a4ed684be265e179a39e4f", "272216c1f097706721096669d85b2843c23fa77d", "0e6824e137847be0599bb0032e37042ed2ef5045", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "061356704ec86334dbbc073985375fe13cd39088", "71b7178df5d2b112d07e45038cb5637208659ff7", "4e88de2930a4435f737c3996287a90ff87b95c59", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "0b544dfe355a5070b60986319a3f51fb45d1348e", "687bac2d3320083eb4530bf18bb8f8f721477600", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "score": 1.6553253790291635}, {"paper_id": "1510cf4b8abea80b9f352325ca4c132887de21a0", "paper_title": "Distributed Representations of Sentences and Documents", "paper_year": 2014, "paper_venue": "ICML", "paper_citations": 51, "paper_abstract": "Many machine learning algorithms require the input to be represented as a fixed-length feature vector. When it comes to texts, one of the most common fixed-length features is bag-of-words. Despite their popularity, bag-of-words features have two major weaknesses: they lose the ordering of the words and they also ignore semantics of the words. For example, \"powerful,\" \"strong\" and \"Paris\" are equally distant. In this paper, we propose Paragraph Vector, an unsupervised algorithm that learns fixed-length feature representations from variable-length pieces of texts, such as sentences, paragraphs, and documents. Our algorithm represents each document by a dense vector which is trained to predict words in the document. Its construction gives our algorithm the potential to overcome the weaknesses of bag-of-words models. Empirical results show that Paragraph Vectors outperform bag-of-words models as well as other techniques for text representations. Finally, we achieve new state-of-the-art results on several text classification and sentiment analysis tasks.", "paper_authors": ["Quoc V. Le", "Tomas Mikolov"], "citations": ["26e743d5bd465f49b9538deaf116c15e61b7951f", "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "93b8da28d006415866bf48f9a6e06b5242129195", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "bc1d609520290e0460c49b685675eb5a57fa5935", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "4e88de2930a4435f737c3996287a90ff87b95c59", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "references": ["cfa2646776405d50533055ceb1b7f050e9014dcb", "3a0e788268fafb23ab20da0e98bb578b06830f7d", "1005645c05585c2042e3410daeed638b55e2474d", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "dac72f2c509aee67524d3321f77e97e8eff51de6"], "score": 1.648442218910883}, {"paper_id": "26e743d5bd465f49b9538deaf116c15e61b7951f", "paper_title": "Learning Distributed Representations of Sentences from Unlabelled Data", "paper_year": 2016, "paper_venue": "HLT-NAACL", "paper_citations": 23, "paper_abstract": "Unsupervised methods for learning distributed representations of words are ubiquitous in today's NLP research, but far less is known about the best ways to learn distributed phrase or sentence representations from unlabelled data. This paper is a systematic comparison of models that learn such representations. We find that the optimal approach depends critically on the intended application. Deeper, more complex models are preferable for representations to be used in supervised systems, but shallow log-linear models work best for building representation spaces that can be decoded with simple spatial distance metrics. We also propose two new unsupervised representation-learning objectives designed to optimise the trade-off between training time, domain portability and performance.", "paper_authors": ["Felix Hill", "Kyunghyun Cho", "Anna Korhonen"], "citations": ["a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "93b8da28d006415866bf48f9a6e06b5242129195", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "bc1d609520290e0460c49b685675eb5a57fa5935", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c"], "references": ["87f40e6f3022adbc1f1905e3e506abad05a9964f", "843959ffdccf31c6694d135fad07425924f785b1", "e74f9b7f8eec6ba4704c206b93bc8079af3da4bd", "1510cf4b8abea80b9f352325ca4c132887de21a0", "cfa2646776405d50533055ceb1b7f050e9014dcb", "39dba6f22d72853561a4ed684be265e179a39e4f", "745d86adca56ec50761591733e157f84cfb19671", "0b544dfe355a5070b60986319a3f51fb45d1348e", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "score": 1.6416915160860335}, {"paper_id": "bc1d609520290e0460c49b685675eb5a57fa5935", "paper_title": "An efficient framework for learning sentence representations", "paper_year": 2018, "paper_venue": "ICLR", "paper_citations": 2, "paper_abstract": "In this work we propose a simple and efficient framework for learning sentence representations from unlabelled data. Drawing inspiration from the distributional hypothesis and recent work on learning sentence representations, we reformulate the problem of predicting the context in which a sentence appears as a classification problem. This allows us to efficiently learn different types of encoding functions, and we show that the model learns high-quality sentence representations. We demonstrate that our sentence representations outperform state-of-the-art unsupervised and supervised representation learning methods on several downstream NLP tasks that involve understanding sentence semantics while achieving an order of magnitude speedup in training time.", "paper_authors": ["Lajanugen Logeswaran", "Honglak Lee"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "26e743d5bd465f49b9538deaf116c15e61b7951f", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "1510cf4b8abea80b9f352325ca4c132887de21a0", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "1005645c05585c2042e3410daeed638b55e2474d", "71b7178df5d2b112d07e45038cb5637208659ff7", "4e88de2930a4435f737c3996287a90ff87b95c59", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "687bac2d3320083eb4530bf18bb8f8f721477600"], "score": 1.6210632361001511}, {"paper_id": "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "paper_title": "Discourse-Based Objectives for Fast Unsupervised Sentence Representation Learning", "paper_year": 2017, "paper_venue": "ArXiv", "paper_citations": 5, "paper_abstract": "This work presents a novel objective function for the unsupervised training of neural network sentence encoders. It exploits signals from paragraph-level discourse coherence to train these models to understand text. Our objective is purely discriminative, allowing us to train models many times faster than was possible under prior methods, and it yields models which perform well in extrinsic evaluations.", "paper_authors": ["Yacine Jernite", "Samuel R. Bowman", "David Sontag"], "citations": ["bc1d609520290e0460c49b685675eb5a57fa5935", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035"], "references": ["26e743d5bd465f49b9538deaf116c15e61b7951f", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "39dba6f22d72853561a4ed684be265e179a39e4f", "0e6824e137847be0599bb0032e37042ed2ef5045", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "05aba481e8a221df5d8775a3bb749001e7f2525e", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292", "687bac2d3320083eb4530bf18bb8f8f721477600"], "score": 1.6092604515143307}, {"paper_id": "1005645c05585c2042e3410daeed638b55e2474d", "paper_title": "A Scalable Hierarchical Distributed Language Model", "paper_year": 2008, "paper_venue": "NIPS", "paper_citations": 26, "paper_abstract": "Neural probabilistic language models (NPLMs) have been shown to be competitive with and occasionally superior to the widely-used n-gram language models. The main drawback of NPLMs is their extremely long training and testing times. Morin and Bengio have proposed a hierarchical language model built around a binary tree of words, which was two orders of magnitude faster than the non-hierarchical model it was based on. However, it performed considerably worse than its non-hierarchical counterpart in spite of using a word tree created using expert knowledge. We introduce a fast hierarchical language model along with a simple feature-based algorithm for automatic construction of word trees from the data. We then show that the resulting models can outperform non-hierarchical neural models as well as the best n-gram models.", "paper_authors": ["Andriy Mnih", "Geoffrey E. Hinton"], "citations": ["87f40e6f3022adbc1f1905e3e506abad05a9964f", "0d67362a5630ec3b7562327acc278c1c996454b5", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "1510cf4b8abea80b9f352325ca4c132887de21a0", "bc1d609520290e0460c49b685675eb5a57fa5935", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "dac72f2c509aee67524d3321f77e97e8eff51de6", "652d159bf64a70194127722d19841daa99a69b64"], "references": ["783480acff435bfbc15ffcdb4f15eccddaa0c810", "23694a80bf1b9b38215be3e23068dd75296bc90f", "d87ceda3042f781c341ac17109d1e94a717f5f60"], "score": 1.5612227278594133}], [{"paper_id": "23694a80bf1b9b38215be3e23068dd75296bc90f", "paper_title": "A Neural Probabilistic Language Model", "paper_year": 2000, "paper_venue": "NIPS", "paper_citations": 92, "paper_abstract": "A goal of statistical language modeling is to learn the joint probability function of sequences of words. This is intrinsically difficult because of the curse of dimensionality: we propose to fight it with its own weapons. In the proposed approach one learns simultaneously (1) a distributed representation for each word (i.e. a similarity between words) along with (2) the probability function for word sequences, expressed with these representations. Generalization is obtained because a sequence of words that has never been seen before gets high probability if it is made of words that are similar to words forming an already seen sentence. We report on experiments using neural networks for the probability function, showing on two text corpora that the proposed approach very significantly improves on a state-of-the-art trigram model.", "paper_authors": ["Yoshua Bengio", "Réjean Ducharme", "Pascal Vincent", "Christian Janvin"], "citations": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "cfa2646776405d50533055ceb1b7f050e9014dcb", "39dba6f22d72853561a4ed684be265e179a39e4f", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d", "745d86adca56ec50761591733e157f84cfb19671", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "071b16f25117fb6133480c6259227d54fc2a5ea0", "0d67362a5630ec3b7562327acc278c1c996454b5", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "1005645c05585c2042e3410daeed638b55e2474d", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "1a07186bc10592f0330655519ad91652125cd907", "dac72f2c509aee67524d3321f77e97e8eff51de6", "687bac2d3320083eb4530bf18bb8f8f721477600", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "b9de9599d7241459db9213b5cdd7059696f5ef8d", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "references": ["783480acff435bfbc15ffcdb4f15eccddaa0c810", "d87ceda3042f781c341ac17109d1e94a717f5f60"], "score": 0.5467792721743329}, {"paper_id": "4e88de2930a4435f737c3996287a90ff87b95c59", "paper_title": "Improved Semantic Representations From Tree-Structured Long Short-Term Memory Networks", "paper_year": 2015, "paper_venue": "ACL", "paper_citations": 47, "paper_abstract": "A Long Short-Term Memory (LSTM) network is a type of recurrent neural network architecture which has recently obtained strong results on a variety of sequence modeling tasks. The only underlying LSTM structure that has been explored so far is a linear chain. However, natural language exhibits syntactic properties that would naturally combine words to phrases. We introduce the Tree-LSTM, a generalization of LSTMs to tree-structured network topologies. TreeLSTMs outperform all existing systems and strong LSTM baselines on two tasks: predicting the semantic relatedness of two sentences (SemEval 2014, Task 1) and sentiment classification (Stanford Sentiment Treebank).", "paper_authors": ["Kai Sheng Tai", "Richard Socher", "Christopher D. Manning"], "citations": ["9784fbf77295860b2e412137b86356d70b25e3c0", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "bc1d609520290e0460c49b685675eb5a57fa5935"], "references": ["87f40e6f3022adbc1f1905e3e506abad05a9964f", "071b16f25117fb6133480c6259227d54fc2a5ea0", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "1510cf4b8abea80b9f352325ca4c132887de21a0", "39dba6f22d72853561a4ed684be265e179a39e4f", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "687bac2d3320083eb4530bf18bb8f8f721477600", "05aba481e8a221df5d8775a3bb749001e7f2525e", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "745d86adca56ec50761591733e157f84cfb19671", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "dac72f2c509aee67524d3321f77e97e8eff51de6", "27e38351e48fe4b7da2775bf94341738bc4da07e", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "score": 0.5094444261129825}, {"paper_id": "27e38351e48fe4b7da2775bf94341738bc4da07e", "paper_title": "Semantic Compositionality through Recursive Matrix-Vector Spaces", "paper_year": 2012, "paper_venue": "EMNLP-CoNLL", "paper_citations": 33, "paper_abstract": "Single-word vector space models have been very successful at learning lexical information. However, they cannot capture the compositional meaning of longer phrases, preventing them from a deeper understanding of language. We introduce a recursive neural network (RNN) model that learns compositional vector representations for phrases and sentences of arbitrary syntactic type and length. Our model assigns a vector and a matrix to every node in a parse tree: the vector captures the inherent meaning of the constituent, while the matrix captures how it changes the meaning of neighboring words or phrases. This matrix-vector RNN can learn the meaning of operators in propositional logic and natural language. The model obtains state of the art performance on three different experiments: predicting fine-grained sentiment distributions of adverb-adjective pairs; classifying sentiment labels of movie reviews and classifying semantic relationships such as cause-effect or topic-message between nouns using the syntactic path between them.", "paper_authors": ["Richard Socher", "Brody Huval", "Christopher D. Manning", "Andrew Y. Ng"], "citations": ["79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "4e88de2930a4435f737c3996287a90ff87b95c59", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292", "687bac2d3320083eb4530bf18bb8f8f721477600"], "references": ["cfa2646776405d50533055ceb1b7f050e9014dcb", "1a07186bc10592f0330655519ad91652125cd907", "3a0e788268fafb23ab20da0e98bb578b06830f7d", "745d86adca56ec50761591733e157f84cfb19671", "ae5e6c6f5513613a161b2c85563f9708bf2e9178"], "score": 0.3483233175085718}, {"paper_id": "745d86adca56ec50761591733e157f84cfb19671", "paper_title": "Composition in Distributional Models of Semantics", "paper_year": 2010, "paper_venue": "Cognitive Science", "paper_citations": 22, "paper_abstract": "Vector-based models of word meaning have become increasingly popular in cognitive science. The appeal of these models lies in their ability to represent meaning simply by using distributional information under the assumption that words occurring within similar contexts are semantically similar. Despite their widespread use, vector-based models are typically directed at representing words in isolation, and methods for constructing representations for phrases or sentences have received little attention in the literature. This is in marked contrast to experimental evidence (e.g., in sentential priming) suggesting that semantic similarity is more complex than simply a relation between isolated words. This article proposes a framework for representing the meaning of word combinations in vector space. Central to our approach is vector composition, which we operationalize in terms of additive and multiplicative functions. Under this framework, we introduce a wide range of composition models that we evaluate empirically on a phrase similarity task.", "paper_authors": ["Jeff Mitchell", "Mirella Lapata"], "citations": ["26e743d5bd465f49b9538deaf116c15e61b7951f", "4e88de2930a4435f737c3996287a90ff87b95c59", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "687bac2d3320083eb4530bf18bb8f8f721477600", "27e38351e48fe4b7da2775bf94341738bc4da07e", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "references": ["23694a80bf1b9b38215be3e23068dd75296bc90f", "27e5bd13d581ef682b96038dce4c18f260122352", "d87ceda3042f781c341ac17109d1e94a717f5f60"], "score": 0.3052743451318632}, {"paper_id": "3a0e788268fafb23ab20da0e98bb578b06830f7d", "paper_title": "From Frequency to Meaning: Vector Space Models of Semantics", "paper_year": 2010, "paper_venue": "J. Artif. Intell. Res.", "paper_citations": 28, "paper_abstract": "Computers understand very little of the meaning of human language. This profoundly limits our ability to give instructions to computers, the ability of computers to explain their actions to us, and the ability of computers to analyse and process text. Vector space models (VSMs) of semantics are beginning to address these limits. This paper surveys the use of VSMs for semantic processing of text. We organize the literature on VSMs according to the structure of the matrix in a VSM. There are currently three broad classes of VSMs, based on term-document, word-context, and pair-pattern matrices, yielding three classes of applications. We survey a broad range of applications in these three categories and we take a detailed look at a specific open source project in each category. Our goal in this survey is to show the breadth of applications of VSMs for semantics, to provide a new perspective on VSMs for those who are already familiar with the area, and to provide pointers into the literature for those who are less familiar with the field.", "paper_authors": ["Peter D. Turney", "Patrick Pantel"], "citations": ["1510cf4b8abea80b9f352325ca4c132887de21a0", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "dac72f2c509aee67524d3321f77e97e8eff51de6", "687bac2d3320083eb4530bf18bb8f8f721477600", "27e38351e48fe4b7da2775bf94341738bc4da07e"], "references": ["1a07186bc10592f0330655519ad91652125cd907", "2c5135a0531bc5ad7dd890f018e67a40529f5bcb", "d87ceda3042f781c341ac17109d1e94a717f5f60"], "score": 0.41249588811145743}, {"paper_id": "d87ceda3042f781c341ac17109d1e94a717f5f60", "paper_title": "WordNet : an electronic lexical database", "paper_year": 2000, "paper_venue": "", "paper_citations": 43, "paper_abstract": "Part 1 The lexical database: nouns in WordNet, George A. Miller modifiers in WordNet, Katherine J. Miller a semantic network of English verbs, Christiane Fellbaum design and implementation of the WordNet lexical database and searching software, Randee I. Tengi. Part 2: automated discovery of WordNet relations, Marti A. Hearst representing verb alterations in WordNet, Karen T. Kohl et al the formalization of WordNet by methods of relational concept analysis, Uta E. Priss. Part 3 Applications of WordNet: building semantic concordances, Shari Landes et al performance and confidence in a semantic annotation task, Christiane Fellbaum et al WordNet and class-based probabilities, Philip Resnik combining local context and WordNet similarity for word sense identification, Claudia Leacock and Martin Chodorow using WordNet for text retrieval, Ellen M. Voorhees lexical chains as representations of context for the detection and correction of malapropisms, Graeme Hirst and David St-Onge temporal indexing through lexical chaining, Reem Al-Halimi and Rick Kazman COLOR-X - using knowledge from WordNet for conceptual modelling, J.F.M. Burg and R.P. van de Riet knowledge processing on an extended WordNet, Sanda M. Harabagiu and Dan I Moldovan appendix - obtaining and using WordNet.", "paper_authors": ["Christiane Fellbaum"], "citations": ["a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "23694a80bf1b9b38215be3e23068dd75296bc90f", "3a0e788268fafb23ab20da0e98bb578b06830f7d", "1005645c05585c2042e3410daeed638b55e2474d", "71b7178df5d2b112d07e45038cb5637208659ff7", "745d86adca56ec50761591733e157f84cfb19671", "38211dc39e41273c0007889202c69f841e02248a"], "references": [], "score": 0.3085260740781458}, {"paper_id": "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f", "paper_title": "A Convolutional Neural Network for Modelling Sentences", "paper_year": 2014, "paper_venue": "ACL", "paper_citations": 34, "paper_abstract": "The ability to accurately represent sentences is central to language understanding. We describe a convolutional architecture dubbed the Dynamic Convolutional Neural Network (DCNN) that we adopt for the semantic modelling of sentences. The network uses Dynamic k-Max Pooling, a global pooling operation over linear sequences. The network handles input sentences of varying length and induces a feature graph over the sentence that is capable of explicitly capturing short and long-range relations. The network does not rely on a parse tree and is easily applicable to any language. We test the DCNN in four experiments: small scale binary and multi-class sentiment prediction, six-way question classification and Twitter sentiment prediction by distant supervision. The network achieves excellent performance in the first three tasks and a greater than 25% error reduction in the last task with respect to the strongest baseline.", "paper_authors": ["Nal Kalchbrenner", "Edward Grefenstette", "Phil Blunsom"], "citations": ["26e743d5bd465f49b9538deaf116c15e61b7951f", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "d1505c6123c102e53eb19dff312cb25cea840b72", "4e88de2930a4435f737c3996287a90ff87b95c59"], "references": ["944a1cfd79dbfb6fef460360a0765ba790f4027a", "cfa2646776405d50533055ceb1b7f050e9014dcb", "162d958ff885f1462aeda91cd72582323fd6a1f4", "687bac2d3320083eb4530bf18bb8f8f721477600", "1a07186bc10592f0330655519ad91652125cd907", "05aba481e8a221df5d8775a3bb749001e7f2525e", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "745d86adca56ec50761591733e157f84cfb19671", "dac72f2c509aee67524d3321f77e97e8eff51de6"], "score": 0.40115120360902995}, {"paper_id": "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "paper_title": "Dynamic Pooling and Unfolding Recursive Autoencoders for Paraphrase Detection", "paper_year": 2011, "paper_venue": "NIPS", "paper_citations": 39, "paper_abstract": "Paraphrase detection is the task of examining two sentences and determining whether they have the same meaning. In order to obtain high accuracy on this task, thorough syntactic and semantic analysis of the two statements is needed. We introduce a method for paraphrase detection based on recursive autoencoders (RAE). Our unsupervised RAEs are based on a novel unfolding objective and learn feature vectors for phrases in syntactic trees. These features are used to measure the word- and phrase-wise similarity between two sentences. Since sentences may be of arbitrary length, the resulting matrix of similarity measures is of variable size. We introduce a novel dynamic pooling layer which computes a fixed-sized representation from the variable-sized matrices. The pooled representation is then used as input to a classifier. Our method outperforms other state-of-the-art approaches on the challenging MSRP paraphrase corpus.", "paper_authors": ["Richard Socher", "Eric H. Huang", "Jeffrey Pennington", "Andrew Y. Ng", "Christopher D. Manning"], "citations": ["6e795c6e9916174ae12349f5dc3f516570c17ce8", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "bc1d609520290e0460c49b685675eb5a57fa5935", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "0b544dfe355a5070b60986319a3f51fb45d1348e", "27e38351e48fe4b7da2775bf94341738bc4da07e"], "references": ["1a07186bc10592f0330655519ad91652125cd907", "cfa2646776405d50533055ceb1b7f050e9014dcb", "dac72f2c509aee67524d3321f77e97e8eff51de6", "23694a80bf1b9b38215be3e23068dd75296bc90f"], "score": 0.41074873703706355}, {"paper_id": "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "paper_title": "Grounded Compositional Semantics for Finding and Describing Images with Sentences", "paper_year": 2014, "paper_venue": "Transactions of the Association for Computational Linguistics", "paper_citations": 25, "paper_abstract": "Previous work on Recursive Neural Networks (RNNs) shows that these models can produce compositional feature vectors for accurately representing and classifying sentences or images. However, the sentence vectors of previous models cannot accurately represent visually grounded meaning. We introduce the DT-RNN model which uses dependency trees to embed sentences into a vector space in order to retrieve images that are described by those sentences. Unlike previous RNN-based models which use constituency trees, DT-RNNs naturally focus on the action and agents in a sentence. They are better able to abstract from the details of word order and syntactic expression. DT-RNNs outperform other recursive and recurrent neural networks, kernelized CCA and a bag-of-words baseline on the tasks of finding an image that fits a sentence description and vice versa. They also give more similar representations to sentences that describe the same image.", "paper_authors": ["Richard Socher", "Andrej Karpathy", "Quoc V. Le", "Christopher D. Manning", "Andrew Y. Ng"], "citations": ["bc8fa64625d9189f5801837e7b133e7fe3c581f7", "4e88de2930a4435f737c3996287a90ff87b95c59", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "references": ["cfa2646776405d50533055ceb1b7f050e9014dcb", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "1a07186bc10592f0330655519ad91652125cd907", "3a0e788268fafb23ab20da0e98bb578b06830f7d", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "05aba481e8a221df5d8775a3bb749001e7f2525e", "745d86adca56ec50761591733e157f84cfb19671", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "38211dc39e41273c0007889202c69f841e02248a", "27e38351e48fe4b7da2775bf94341738bc4da07e"], "score": 0.3835150430374165}, {"paper_id": "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "paper_title": "Improving Word Representations via Global Context and Multiple Word Prototypes", "paper_year": 2012, "paper_venue": "ACL", "paper_citations": 27, "paper_abstract": "Unsupervised word representations are very useful in NLP tasks both as inputs to learning algorithms and as extra word features in NLP systems. However, most of these models are built with only local context and one representation per word. This is problematic because words are often polysemous and global context can also provide useful information for learning word meanings. We present a new neural network architecture which 1) learns word embeddings that better capture the semantics of words by incorporating both local and global document context, and 2) accounts for homonymy and polysemy by learning multiple embeddings per word. We introduce a new dataset with human judgments on pairs of words in sentential context, and evaluate our model on it, showing that our model outperforms competitive baselines and other neural language models.", "paper_authors": ["Eric H. Huang", "Richard Socher", "Christopher D. Manning", "Andrew Y. Ng"], "citations": ["59761abc736397539bdd01ad7f9d91c8607c0457", "4e88de2930a4435f737c3996287a90ff87b95c59", "1510cf4b8abea80b9f352325ca4c132887de21a0", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "687bac2d3320083eb4530bf18bb8f8f721477600"], "references": ["cfa2646776405d50533055ceb1b7f050e9014dcb", "23694a80bf1b9b38215be3e23068dd75296bc90f", "1a07186bc10592f0330655519ad91652125cd907", "1005645c05585c2042e3410daeed638b55e2474d", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "dac72f2c509aee67524d3321f77e97e8eff51de6"], "score": 0.4968652270152215}, {"paper_id": "cfa2646776405d50533055ceb1b7f050e9014dcb", "paper_title": "Semi-Supervised Recursive Autoencoders for Predicting Sentiment Distributions", "paper_year": 2011, "paper_venue": "EMNLP", "paper_citations": 29, "paper_abstract": "We introduce a novel machine learning framework based on recursive autoencoders for sentence-level prediction of sentiment label distributions. Our method learns vector space representations for multi-word phrases. In sentiment prediction tasks these representations outperform other state-of-the-art approaches on commonly used datasets, such as movie reviews, without using any pre-defined sentiment lexica or polarity shifting rules. We also evaluate the model's ability to predict sentiment distributions on a new dataset based on confessions from the experience project. The dataset consists of personal user stories annotated with multiple labels which, when aggregated, form a multinomial distribution that captures emotional reactions. Our algorithm can more accurately predict distributions over such labels compared to several competitive baselines.", "paper_authors": ["Richard Socher", "Jeffrey Pennington", "Eric H. Huang", "Andrew Y. Ng", "Christopher D. Manning"], "citations": ["26e743d5bd465f49b9538deaf116c15e61b7951f", "59761abc736397539bdd01ad7f9d91c8607c0457", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "1510cf4b8abea80b9f352325ca4c132887de21a0", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "79dc84a3bf76f1cb983902e2591d913cee5bdb0e", "ae5e6c6f5513613a161b2c85563f9708bf2e9178", "687bac2d3320083eb4530bf18bb8f8f721477600", "27e38351e48fe4b7da2775bf94341738bc4da07e", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "references": ["1a07186bc10592f0330655519ad91652125cd907", "dac72f2c509aee67524d3321f77e97e8eff51de6", "23694a80bf1b9b38215be3e23068dd75296bc90f"], "score": 0.47352010036396425}]], [[{"paper_id": "87f40e6f3022adbc1f1905e3e506abad05a9964f", "paper_title": "Distributed Representations of Words and Phrases and their Compositionality", "paper_year": 2013, "paper_venue": "NIPS", "paper_citations": 114, "paper_abstract": "The recently introduced continuous Skip-gram model is an efficient method for learning high-quality distributed vector representations that capture a large number of precise syntactic and semantic word relationships. In this paper we present several extensions that improve both the quality of the vectors and the training speed. By subsampling of the frequent words we obtain significant speedup and also learn more regular word representations. We also describe a simple alternative to the hierarchical softmax called negative sampling. An inherent limitation of word representations is their indifference to word order and their inability to represent idiomatic phrases. For example, the meanings of \"Canada\" and \"Air\" cannot be easily combined to obtain \"Air Canada\". Motivated by this example, we present a simple method for finding phrases in text, and show that learning good vector representations for millions of phrases is possible.", "paper_authors": ["Tomas Mikolov", "Ilya Sutskever", "Kai Chen", "Gregory S. Corrado", "Jeffrey Dean"], "citations": ["59761abc736397539bdd01ad7f9d91c8607c0457", "26e743d5bd465f49b9538deaf116c15e61b7951f", "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "9784fbf77295860b2e412137b86356d70b25e3c0", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "1e077413b25c4d34945cc2707e17e46ed4fe784a", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "bc1d609520290e0460c49b685675eb5a57fa5935", "421fc2556836a6b441de806d7b393a35b6eaea58", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "4e88de2930a4435f737c3996287a90ff87b95c59", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "references": ["1a07186bc10592f0330655519ad91652125cd907", "dac72f2c509aee67524d3321f77e97e8eff51de6", "1005645c05585c2042e3410daeed638b55e2474d", "23694a80bf1b9b38215be3e23068dd75296bc90f"], "score": 1.7229577779464307}, {"paper_id": "10f97f1fb4f5c2c8e6c44d4a33da46d331dd4aeb", "paper_title": "Introduction to the CoNLL-2003 Shared Task: Language-Independent Named Entity Recognition", "paper_year": 2003, "paper_venue": "CoNLL", "paper_citations": 16, "paper_abstract": "We describe the CoNLL-2003 shared task: language-independent named entity recognition. We give background information on the data sets (English and German) and the evaluation method, present a general overview of the systems that have taken part in the task and discuss their performance.", "paper_authors": ["Erik F. Tjong Kim Sang", "Fien De Meulder"], "citations": ["f37e1b62a767a307c046404ca96bc140b3e68cb5", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "ac11062f1f368d97f4c826c317bf50dcc13fdb59"], "references": [], "score": 1.611458522770409}, {"paper_id": "3febb2bed8865945e7fddc99efd791887bb7e14f", "paper_title": "Deep contextualized word representations", "paper_year": 2018, "paper_venue": "NAACL-HLT", "paper_citations": 22, "paper_abstract": "We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pretrained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pretrained network is crucial, allowing downstream models to mix different types of semi-supervision signals.", "paper_authors": ["Matthew E. Peters", "Mark Neumann", "Mohit Iyyer", "Matt Gardner", "Christopher Clark", "Kenton Lee", "Luke Zettlemoyer"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "93b8da28d006415866bf48f9a6e06b5242129195", "1e077413b25c4d34945cc2707e17e46ed4fe784a", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "421fc2556836a6b441de806d7b393a35b6eaea58", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "e0222a1ae6874f7fff128c3da8769ab95963da04", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["007ab5528b3bd310a80d553cccad4b78dc496b02", "10f97f1fb4f5c2c8e6c44d4a33da46d331dd4aeb", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "05dd7254b632376973f3a1b4d39485da17814df5", "0c7f52c753a65ceaf3755e20b906ffd0c05c994a", "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "5d833331b0e22ff359db05c62a8bca18c4f04b68", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "272216c1f097706721096669d85b2843c23fa77d", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "dac72f2c509aee67524d3321f77e97e8eff51de6", "687bac2d3320083eb4530bf18bb8f8f721477600", "59761abc736397539bdd01ad7f9d91c8607c0457", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "3c78c6df5eb1695b6a399e346dde880af27d1016", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 1.763266229679119}, {"paper_id": "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "paper_title": "Semi-Supervised Sequence Modeling with Cross-View Training", "paper_year": 2018, "paper_venue": "EMNLP", "paper_citations": 1, "paper_abstract": "Unsupervised representation learning algorithms such as word2vec and ELMo improve the accuracy of many supervised NLP models, mainly because they can take advantage of large amounts of unlabeled text. However, the supervised models only learn from task-specific labeled data during the main training phase. We therefore propose Cross-View Training (CVT), a semi-supervised learning algorithm that improves the representations of a Bi-LSTM sentence encoder using a mix of labeled and unlabeled data. On labeled examples, standard supervised learning is used. On unlabeled examples, CVT teaches auxiliary prediction modules that see restricted views of the input (e.g., only part of a sentence) to match the predictions of the full model seeing the whole input. Since the auxiliary modules and the full model share intermediate representations, this in turn improves the full model. Moreover, we show that CVT is particularly effective when combined with multi-task learning. We evaluate CVT on five sequence tagging tasks, machine translation, and dependency parsing, achieving state-of-the-art results.", "paper_authors": ["Kevin Clark", "Minh-Thang Luong", "Christopher D. Manning", "Quoc V. Le"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": ["10f97f1fb4f5c2c8e6c44d4a33da46d331dd4aeb", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "39dba6f22d72853561a4ed684be265e179a39e4f", "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "26e743d5bd465f49b9538deaf116c15e61b7951f", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "071b16f25117fb6133480c6259227d54fc2a5ea0", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "1e077413b25c4d34945cc2707e17e46ed4fe784a", "5d833331b0e22ff359db05c62a8bca18c4f04b68", "3febb2bed8865945e7fddc99efd791887bb7e14f", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "1a07186bc10592f0330655519ad91652125cd907", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "93499a7c7f699b6630a86fad964536f9423bb6d0", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "score": 1.6119511606840125}, {"paper_id": "1e077413b25c4d34945cc2707e17e46ed4fe784a", "paper_title": "Universal Language Model Fine-tuning for Text Classification", "paper_year": 2018, "paper_venue": "ACL", "paper_citations": 6, "paper_abstract": "Inductive transfer learning has greatly impacted computer vision, but existing approaches in NLP still require task-specific modifications and training from scratch. We propose Universal Language Model Fine-tuning (ULMFiT), an effective transfer learning method that can be applied to any task in NLP, and introduce techniques that are key for fine-tuning a language model. Our method significantly outperforms the state-of-the-art on six text classification tasks, reducing the error by 18-24% on the majority of datasets. Furthermore, with only 100 labeled examples, it matches the performance of training from scratch on 100x more data. We open-source our pretrained models and code.", "paper_authors": ["Jeremy Howard", "Sebastian Ruder"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035"], "references": ["2c03df8b48bf3fa39054345bafabfeff15bfd11d", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "081651b38ff7533550a3adfc1c00da333a8fe86c"], "score": 1.6453177729586668}, {"paper_id": "2c5135a0531bc5ad7dd890f018e67a40529f5bcb", "paper_title": "A Framework for Learning Predictive Structures from Multiple Tasks and Unlabeled Data", "paper_year": 2005, "paper_venue": "J. Mach. Learn. Res.", "paper_citations": 19, "paper_abstract": "One of the most important issues in machine learning is whether one can improve the performance of a supervised learning algorithm by including unlabeled data. Methods that use both labeled and unlabeled data are generally referred to as semi-supervised learning. Although a number of such methods are proposed, at the current stage, we still don't have a complete understanding of their effectiveness. This paper investigates a closely related problem, which leads to a novel approach to semi-supervised learning. Specifically we consider learning predictive structures on hypothesis spaces (that is, what kind of classifiers have good predictive power) from multiple learning tasks. We present a general framework in which the structural learning problem can be formulated and analyzed theoretically, and relate it to learning with unlabeled data. Under this framework, algorithms for structural learning will be proposed, and computational issues will be investigated. Experiments will be given to demonstrate the effectiveness of the proposed algorithms in the semi-supervised learning setting.", "paper_authors": ["Rie Kubota Ando", "Tong Zhang"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "1a07186bc10592f0330655519ad91652125cd907", "3a0e788268fafb23ab20da0e98bb578b06830f7d", "9fa8d73e572c3ca824a04a5f551b602a17831bc5", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "references": [], "score": 1.5259808728447481}, {"paper_id": "4aa9f5150b46320f534de4747a2dd0cd7f3fe292", "paper_title": "Semi-supervised Sequence Learning", "paper_year": 2015, "paper_venue": "NIPS", "paper_citations": 24, "paper_abstract": "We present two approaches that use unlabeled data to improve sequence learning with recurrent networks. The first approach is to predict what comes next in a sequence, which is a conventional language model in natural language processing. The second approach is to use a sequence autoencoder, which reads the input sequence into a vector and predicts the input sequence again. These two algorithms can be used as a \"pretraining\" step for a later supervised sequence learning algorithm. In other words, the parameters obtained from the unsupervised step can be used as a starting point for other supervised training models. In our experiments, we find that long short term memory recurrent networks after being pretrained with the two approaches are more stable and generalize better. With pretraining, we are able to train long short term memory recurrent networks up to a few hundred timesteps, thereby achieving strong performance in many text classification tasks, such as IMDB, DBpedia and 20 Newsgroups.", "paper_authors": ["Andrew M. Dai", "Quoc V. Le"], "citations": ["1e077413b25c4d34945cc2707e17e46ed4fe784a", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "3febb2bed8865945e7fddc99efd791887bb7e14f", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "bc8fa64625d9189f5801837e7b133e7fe3c581f7"], "references": ["47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "1510cf4b8abea80b9f352325ca4c132887de21a0", "39dba6f22d72853561a4ed684be265e179a39e4f", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "687bac2d3320083eb4530bf18bb8f8f721477600", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "2c5135a0531bc5ad7dd890f018e67a40529f5bcb", "27e38351e48fe4b7da2775bf94341738bc4da07e"], "score": 1.6116672668578285}, {"paper_id": "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "paper_title": "Semi-supervised sequence tagging with bidirectional language models", "paper_year": 2017, "paper_venue": "ACL", "paper_citations": 11, "paper_abstract": "Pre-trained word embeddings learned from unlabeled text have become a standard component of neural network architectures for NLP tasks. However, in most cases, the recurrent network that operates on word-level representations to produce context sensitive representations is trained on relatively little labeled data. In this paper, we demonstrate a general semi-supervised approach for adding pre- trained context embeddings from bidirectional language models to NLP systems and apply it to sequence labeling tasks. We evaluate our model on two standard datasets for named entity recognition (NER) and chunking, and in both cases achieve state of the art results, surpassing previous systems that use other forms of transfer or joint learning with additional labeled data and task specific gazetteers.", "paper_authors": ["Matthew E. Peters", "Waleed Ammar", "Chandra Bhagavatula", "Russell Power"], "citations": ["1e077413b25c4d34945cc2707e17e46ed4fe784a", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "421fc2556836a6b441de806d7b393a35b6eaea58", "ac11062f1f368d97f4c826c317bf50dcc13fdb59"], "references": ["87f40e6f3022adbc1f1905e3e506abad05a9964f", "26e743d5bd465f49b9538deaf116c15e61b7951f", "59761abc736397539bdd01ad7f9d91c8607c0457", "10f97f1fb4f5c2c8e6c44d4a33da46d331dd4aeb", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "944a1cfd79dbfb6fef460360a0765ba790f4027a", "5d833331b0e22ff359db05c62a8bca18c4f04b68", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "1510cf4b8abea80b9f352325ca4c132887de21a0", "272216c1f097706721096669d85b2843c23fa77d", "23694a80bf1b9b38215be3e23068dd75296bc90f", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "0c7f52c753a65ceaf3755e20b906ffd0c05c994a", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "score": 1.6901561710197115}, {"paper_id": "843959ffdccf31c6694d135fad07425924f785b1", "paper_title": "Extracting and composing robust features with denoising autoencoders", "paper_year": 2008, "paper_venue": "ICML", "paper_citations": 19, "paper_abstract": "Previous work has shown that the difficulties in learning deep generative or discriminative models can be overcome by an initial unsupervised learning step that maps inputs to useful intermediate representations. We introduce and motivate a new training principle for unsupervised learning of a representation based on the idea of making the learned representations robust to partial corruption of the input pattern. This approach can be used to train autoencoders, and these denoising autoencoders can be stacked to initialize deep architectures. The algorithm can be motivated from a manifold learning and information theoretic perspective or from a generative model perspective. Comparative experiments clearly show the surprising advantage of corrupting the input of autoencoders on a pattern classification benchmark suite.", "paper_authors": ["Pascal Vincent", "Hugo Larochelle", "Yoshua Bengio", "Pierre-Antoine Manzagol"], "citations": ["26e743d5bd465f49b9538deaf116c15e61b7951f", "0d67362a5630ec3b7562327acc278c1c996454b5", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "references": ["0d67362a5630ec3b7562327acc278c1c996454b5"], "score": 1.5009403967279114}, {"paper_id": "9fa8d73e572c3ca824a04a5f551b602a17831bc5", "paper_title": "Domain Adaptation with Structural Correspondence Learning", "paper_year": 2006, "paper_venue": "EMNLP", "paper_citations": 13, "paper_abstract": "Discriminative learning methods are widely used in natural language processing. These methods work best when their training and test data are drawn from the same distribution. For many NLP tasks, however, we are confronted with new domains in which labeled data is scarce or non-existent. In such cases, we seek to adapt existing models from a resource-rich source domain to a resource-poor target domain. We introduce structural correspondence learning to automatically induce correspondences among features from different domains. We test our technique on part of speech tagging and show performance gains for varying amounts of source and target training data, as well as improvements in target domain parsing accuracy using our improved tagger.", "paper_authors": ["John Blitzer", "Ryan T. McDonald", "Fernando C Pereira"], "citations": ["5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": ["783480acff435bfbc15ffcdb4f15eccddaa0c810", "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "2c5135a0531bc5ad7dd890f018e67a40529f5bcb"], "score": 1.51492518752453}, {"paper_id": "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "paper_title": "Dissecting Contextual Word Embeddings: Architecture and Representation", "paper_year": 2018, "paper_venue": "EMNLP", "paper_citations": 1, "paper_abstract": "Contextual word representations derived from pre-trained bidirectional language models (biLMs) have recently been shown to provide significant improvements to the state of the art for a wide range of NLP tasks. However, many questions remain as to how and why these models are so effective. In this paper, we present a detailed empirical study of how the choice of neural architecture (e.g. LSTM, CNN, or self attention) influences both end task accuracy and qualitative properties of the representations that are learned. We show there is a tradeoff between speed and accuracy, but all architectures learn high quality contextual representations that outperform word embeddings for four challenging NLP tasks. Additionally, all architectures learn representations that vary with network depth, from exclusively morphological based at the word embedding layer through local syntax based in the lower contextual layers to longer range semantics such coreference at the upper layers. Together, these results suggest that unsupervised biLMs, independent of architecture, are learning much more about the structure of language than previously appreciated.", "paper_authors": ["Matthew E. Peters", "Mark Neumann", "Luke Zettlemoyer", "Wen-tau Yih"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "2c03df8b48bf3fa39054345bafabfeff15bfd11d", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "10f97f1fb4f5c2c8e6c44d4a33da46d331dd4aeb", "1e077413b25c4d34945cc2707e17e46ed4fe784a", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "5d833331b0e22ff359db05c62a8bca18c4f04b68", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "0c7f52c753a65ceaf3755e20b906ffd0c05c994a", "0b44fcbeea9415d400c5f5789d6b892b6f98daff"], "score": 1.6257765373120039}, {"paper_id": "59761abc736397539bdd01ad7f9d91c8607c0457", "paper_title": "context2vec: Learning Generic Context Embedding with Bidirectional LSTM", "paper_year": 2016, "paper_venue": "CoNLL", "paper_citations": 5, "paper_abstract": "Context representations are central to various NLP tasks, such as word sense disambiguation, named entity recognition, coreference resolution, and many more. In this work we present a neural model for efficiently learning a generic context embedding function from large corpora, using bidirectional LSTM. With a very simple application of our context representations, we manage to surpass or nearly reach state-of-the-art results on sentence completion, lexical substitution and word sense disambiguation tasks, while substantially outperforming the popular context representation of averaged word embeddings. We release our code and pretrained models, suggesting they could be useful in a wide variety of NLP tasks.", "paper_authors": ["Oren Melamud", "Jacob Goldberger", "Ido Dagan"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "cfa2646776405d50533055ceb1b7f050e9014dcb", "272216c1f097706721096669d85b2843c23fa77d", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "dac72f2c509aee67524d3321f77e97e8eff51de6"], "score": 1.5973458885073284}, {"paper_id": "5d833331b0e22ff359db05c62a8bca18c4f04b68", "paper_title": "One Billion Word Benchmark for Measuring Progress in Statistical Language Modeling", "paper_year": 2013, "paper_venue": "INTERSPEECH", "paper_citations": 27, "paper_abstract": "We propose a new benchmark corpus to be used for measuring progress in statistical language modeling. With almost one billion words of training data, we hope this benchmark will be useful to quickly evaluate novel language modeling techniques, and to compare their contribution when combined with other advanced techniques. We show performance of several well-known types of language models, with the best results achieved with a recurrent neural network based language model. The baseline unpruned Kneser-Ney 5-gram model achieves perplexity 67.6; a combination of techniques leads to 35% reduction in perplexity, or 10% reduction in cross-entropy (bits), over that baseline. \nThe benchmark is available as a code.google.com project; besides the scripts needed to rebuild the training/held-out data, it also makes available log-probability values for each word in each of ten held-out data sets, for each of the baseline n-gram models.", "paper_authors": ["Ciprian Chelba", "Tomas Mikolov", "Michael Schuster", "Qi Ge", "Thorsten Brants", "Phillipp Koehn", "Tony Robinson"], "citations": ["93b8da28d006415866bf48f9a6e06b5242129195", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "421fc2556836a6b441de806d7b393a35b6eaea58", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "b9de9599d7241459db9213b5cdd7059696f5ef8d"], "references": ["47a87c2cbdd928bb081974d308b3d9cf678d257e"], "score": 1.6024574978583475}, {"paper_id": "783480acff435bfbc15ffcdb4f15eccddaa0c810", "paper_title": "Class-Based n-gram Models of Natural Language", "paper_year": 1992, "paper_venue": "Computational Linguistics", "paper_citations": 22, "paper_abstract": "We address the problem of predicting a word from previous words in a sample of text. In particular, we discuss n-gram models based on classes of words. We also discuss several statistical algorithms for assigning words to classes based on the frequency of their co-occurrence with other words. We find that we are able to extract classes that have the flavor of either syntactically based groupings or semantically based groupings, depending on the nature of the underlying statistics.", "paper_authors": ["Peter F. Brown", "Vincent J. Della Pietra", "Peter V. de Souza", "Jennifer C. Lai", "Robert L. Mercer"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "23694a80bf1b9b38215be3e23068dd75296bc90f", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "1005645c05585c2042e3410daeed638b55e2474d", "9fa8d73e572c3ca824a04a5f551b602a17831bc5", "dac72f2c509aee67524d3321f77e97e8eff51de6"], "references": [], "score": 1.5315613171626992}, {"paper_id": "421fc2556836a6b441de806d7b393a35b6eaea58", "paper_title": "Contextual String Embeddings for Sequence Labeling", "paper_year": 2018, "paper_venue": "COLING", "paper_citations": 1, "paper_abstract": "Recent advances in language modeling using recurrent neural networks have made it viable to model language as distributions over characters. By learning to predict the next character on the basis of previous characters, such models have been shown to automatically internalize linguistic concepts such as words, sentences, subclauses and even sentiment. In this paper, we propose to leverage the internal states of a trained character language model to produce a novel type of word embedding which we refer to as contextual string embeddings. Our proposed embeddings have the distinct properties that they (a) are trained without any explicit notion of words and thus fundamentally model words as sequences of characters, and (b) are contextualized by their surrounding text, meaning that the same word will have different embeddings depending on its contextual use. We conduct a comparative evaluation against previous embeddings and find that our embeddings are highly useful for downstream tasks: across four classic sequence labeling tasks we consistently outperform the previous state-of-the-art. In particular, we significantly outperform previous work on English and German named entity recognition (NER), allowing us to report new state-of-the-art F1-scores on the CONLL03 shared task. We release all code and pre-trained language models in a simple-to-use framework to the research community, to enable reproduction of these experiments and application of our proposed embeddings to other tasks: https://github.com/zalandoresearch/flair", "paper_authors": ["Alan Akbik", "Duncan Blythe", "Roland Vollgraf"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": ["87f40e6f3022adbc1f1905e3e506abad05a9964f", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "5d833331b0e22ff359db05c62a8bca18c4f04b68", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "39dba6f22d72853561a4ed684be265e179a39e4f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "652d159bf64a70194127722d19841daa99a69b64"], "score": 1.5636758125509762}, {"paper_id": "766ce989b8b8b984f7a4691fd8c9af4bdb2b74cd", "paper_title": "\"Cloze procedure\": a new tool for measuring readability.", "paper_year": 1953, "paper_venue": "", "paper_citations": 11, "paper_abstract": "Here is the first comprehensive statement of a research method and its theory which were introduced briefly during a workshop at the 1953 AEJ convention. Included are findings from three pilot studies and two experiments in which “cloze procedure” results are compared with those of two readability formulas.", "paper_authors": ["Wilson L. Taylor"], "citations": ["d1505c6123c102e53eb19dff312cb25cea840b72", "df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": [], "score": 1.4115477531089813}], [{"paper_id": "2538e3eb24d26f31482c479d95d2e26c0e79b990", "paper_title": "Natural Language Processing (almost) from Scratch", "paper_year": 2011, "paper_venue": "J. Mach. Learn. Res.", "paper_citations": 65, "paper_abstract": "We propose a unified neural network architecture and learning algorithm that can be applied to various natural language processing tasks including: part-of-speech tagging, chunking, named entity recognition, and semantic role labeling. This versatility is achieved by trying to avoid task-specific engineering and therefore disregarding a lot of prior knowledge. Instead of exploiting man-made input features carefully optimized for each task, our system learns internal representations on the basis of vast amounts of mostly unlabeled training data. This work is then used as a basis for building a freely available tagging system with good performance and minimal computational requirements.", "paper_authors": ["Ronan Collobert", "Jason Weston", "Léon Bottou", "Michael Karlen", "Koray Kavukcuoglu", "Pavel P. Kuksa"], "citations": ["93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "d1505c6123c102e53eb19dff312cb25cea840b72"], "references": ["162d958ff885f1462aeda91cd72582323fd6a1f4", "783480acff435bfbc15ffcdb4f15eccddaa0c810", "0c7f52c753a65ceaf3755e20b906ffd0c05c994a", "dac72f2c509aee67524d3321f77e97e8eff51de6", "2c5135a0531bc5ad7dd890f018e67a40529f5bcb"], "score": 0.5657197339187694}, {"paper_id": "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "paper_title": "Building a Large Annotated Corpus of English: The Penn Treebank", "paper_year": 1993, "paper_venue": "Computational Linguistics", "paper_citations": 83, "paper_abstract": "Abstract : As a result of this grant, the researchers have now published oil CDROM a corpus of over 4 million words of running text annotated with part-of- speech (POS) tags, with over 3 million words of that material assigned skeletal grammatical structure. This material now includes a fully hand-parsed version of the classic Brown corpus. About one half of the papers at the ACL Workshop on Using Large Text Corpora this past summer were based on the materials generated by this grant.", "paper_authors": ["Mitchell P. Marcus", "Beatrice Santorini", "Mary Ann Marcinkiewicz"], "citations": ["47570e7f63e296f224a0e7f9a0d08b0de3cbaf40", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "05dd7254b632376973f3a1b4d39485da17814df5", "3febb2bed8865945e7fddc99efd791887bb7e14f", "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "9fa8d73e572c3ca824a04a5f551b602a17831bc5", "7f4afc1bf3272ae6ec00b46e27efc4a4f6b0826d", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "652d159bf64a70194127722d19841daa99a69b64"], "references": [], "score": 0.4855553804973661}, {"paper_id": "02b3d1d162080d9aefd3fc30a0bcc9a843073b5d", "paper_title": "Exploring the Limits of Language Modeling", "paper_year": 2016, "paper_venue": "ArXiv", "paper_citations": 29, "paper_abstract": "In this work we explore recent advances in Recurrent Neural Networks for large scale Language Modeling, a task central to language understanding. We extend current models to deal with two key challenges present in this task: corpora and vocabulary sizes, and complex, long term structure of language. We perform an exhaustive study on techniques such as character Convolutional Neural Networks or Long-Short Term Memory, on the One Billion Word Benchmark. Our best single model significantly improves state-of-the-art perplexity from 51.3 down to 30.0 (whilst reducing the number of parameters by a factor of 20), while an ensemble of models sets a new record by improving perplexity from 41.0 down to 23.7. We also release these models for the NLP and ML community to study and improve upon.", "paper_authors": ["Rafal Józefowicz", "Oriol Vinyals", "Mike Schuster", "Noam Shazeer", "Yonghui Wu"], "citations": ["59761abc736397539bdd01ad7f9d91c8607c0457", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "421fc2556836a6b441de806d7b393a35b6eaea58", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "b9de9599d7241459db9213b5cdd7059696f5ef8d", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "references": ["0b544dfe355a5070b60986319a3f51fb45d1348e", "5d833331b0e22ff359db05c62a8bca18c4f04b68", "39dba6f22d72853561a4ed684be265e179a39e4f", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "1005645c05585c2042e3410daeed638b55e2474d", "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "38211dc39e41273c0007889202c69f841e02248a", "652d159bf64a70194127722d19841daa99a69b64", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "score": 0.5486650991545718}, {"paper_id": "0d67362a5630ec3b7562327acc278c1c996454b5", "paper_title": "Learning Deep Architectures for AI", "paper_year": 2007, "paper_venue": "Foundations and Trends in Machine Learning", "paper_citations": 19, "paper_abstract": "Theoretical results strongly suggest that in order to learn the kind of complicated functions that can represent high-level abstractions (e.g. in vision, language, and other AI-level tasks), one needs deep architectures. Deep architectures are composed of multiple levels of non-linear operations, such as in neural nets with many hidden layers or in complicated propositional formulae re-using many sub-formulae. Searching the parameter space of deep architectures is a difficult optimization task, but learning algorithms such as those for Deep Belief Networks have recently been proposed to tackle this problem with notable success, beating the state-of-the-art in certain areas. This paper discusses the motivations and principles regarding learning algorithms for deep architectures, in particular those exploiting as building blocks unsupervised learning of single-layer models such as Restricted Boltzmann Machines, used to construct deeper models such as Deep Belief Networks.", "paper_authors": ["Yoshua Bengio"], "citations": ["a4cec122a08216fe8a3bc19b22e78fbaea096256", "843959ffdccf31c6694d135fad07425924f785b1", "f37e1b62a767a307c046404ca96bc140b3e68cb5"], "references": ["843959ffdccf31c6694d135fad07425924f785b1", "162d958ff885f1462aeda91cd72582323fd6a1f4", "23694a80bf1b9b38215be3e23068dd75296bc90f", "1a07186bc10592f0330655519ad91652125cd907", "1005645c05585c2042e3410daeed638b55e2474d"], "score": 0.4387485806837209}, {"paper_id": "0c7f52c753a65ceaf3755e20b906ffd0c05c994a", "paper_title": "Conditional Random Fields: Probabilistic Models for Segmenting and Labeling Sequence Data", "paper_year": 2001, "paper_venue": "ICML", "paper_citations": 44, "paper_abstract": "We present conditional random fields , a framework for building probabilistic models to segment and label sequence data. Conditional random fields offer several advantages over hidden Markov models and stochastic grammars for such tasks, including the ability to relax strong independence assumptions made in those models. Conditional random fields also avoid a fundamental limitation of maximum entropy Markov models (MEMMs) and other discriminative Markov models based on directed graphical models, which can be biased towards states with few successor states. We present iterative parameter estimation algorithms for conditional random fields and compare the performance of the resulting models to HMMs and MEMMs on synthetic and natural-language data.", "paper_authors": ["John D. Lafferty", "Andrew McCallum", "Fernando C Pereira"], "citations": ["2538e3eb24d26f31482c479d95d2e26c0e79b990", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38"], "references": ["162d958ff885f1462aeda91cd72582323fd6a1f4"], "score": 0.4028429169865969}, {"paper_id": "162d958ff885f1462aeda91cd72582323fd6a1f4", "paper_title": "Gradient-based learning applied to document recognition", "paper_year": 1998, "paper_venue": "", "paper_citations": 44, "paper_abstract": "Multilayer neural networks trained with the back-propagation algorithm constitute the best example of a successful gradient based learning technique. Given an appropriate network architecture, gradient-based learning algorithms can be used to synthesize a complex decision surface that can classify high-dimensional patterns, such as handwritten characters, with minimal preprocessing. This paper reviews various methods applied to handwritten character recognition and compares them on a standard handwritten digit recognition task. Convolutional neural networks, which are specifically designed to deal with the variability of 2D shapes, are shown to outperform all other techniques. Real-life document recognition systems are composed of multiple modules including field extraction, segmentation recognition, and language modeling. A new learning paradigm, called graph transformer networks (GTN), allows such multimodule systems to be trained globally using gradient-based methods so as to minimize an overall performance measure. Two systems for online handwriting recognition are described. Experiments demonstrate the advantage of global training, and the flexibility of graph transformer networks. A graph transformer network for reading a bank cheque is also described. It uses convolutional neural network character recognizers combined with global training techniques to provide record accuracy on business and personal cheques. It is deployed commercially and reads several million cheques per day.", "paper_authors": ["Yann LeCun", "Léon Bottou", "Yoshua Bengio", "Patrick Haffner"], "citations": ["0d67362a5630ec3b7562327acc278c1c996454b5", "a4cec122a08216fe8a3bc19b22e78fbaea096256", "39dba6f22d72853561a4ed684be265e179a39e4f", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "1a07186bc10592f0330655519ad91652125cd907", "0c7f52c753a65ceaf3755e20b906ffd0c05c994a", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "references": [], "score": 0.29939232777362745}]], [[{"paper_id": "f37e1b62a767a307c046404ca96bc140b3e68cb5", "paper_title": "Glove: Global Vectors for Word Representation", "paper_year": 2014, "paper_venue": "EMNLP", "paper_citations": 157, "paper_abstract": "Recent methods for learning vector space representations of words have succeeded in capturing fine-grained semantic and syntactic regularities using vector arithmetic, but the origin of these regularities has remained opaque. We analyze and make explicit the model properties needed for such regularities to emerge in word vectors. The result is a new global logbilinear regression model that combines the advantages of the two major model families in the literature: global matrix factorization and local context window methods. Our model efficiently leverages statistical information by training only on the nonzero elements in a word-word cooccurrence matrix, rather than on the entire sparse matrix or on individual context windows in a large corpus. The model produces a vector space with meaningful substructure, as evidenced by its performance of 75% on a recent word analogy task. It also outperforms related models on similarity tasks and named entity recognition.", "paper_authors": ["Jeffrey Pennington", "Richard Socher", "Christopher D. Manning"], "citations": ["007ab5528b3bd310a80d553cccad4b78dc496b02", "bc1d609520290e0460c49b685675eb5a57fa5935", "4e88de2930a4435f737c3996287a90ff87b95c59", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb", "93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "b1e20420982a4f923c08652941666b189b11b7fe", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "27e98e09cf09bc13c913d01676e5f32624011050", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "e0222a1ae6874f7fff128c3da8769ab95963da04", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "26b47e35fe6e4260fdf7b7cc98f279a73c277494", "59761abc736397539bdd01ad7f9d91c8607c0457", "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "421fc2556836a6b441de806d7b393a35b6eaea58", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "3c78c6df5eb1695b6a399e346dde880af27d1016"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "0d67362a5630ec3b7562327acc278c1c996454b5", "10f97f1fb4f5c2c8e6c44d4a33da46d331dd4aeb", "23694a80bf1b9b38215be3e23068dd75296bc90f", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "1a07186bc10592f0330655519ad91652125cd907", "05aba481e8a221df5d8775a3bb749001e7f2525e", "dac72f2c509aee67524d3321f77e97e8eff51de6"], "score": 1.8114446870034357}, {"paper_id": "f04df4e20a18358ea2f689b4c129781628ef7fc1", "paper_title": "A large annotated corpus for learning natural language inference", "paper_year": 2015, "paper_venue": "EMNLP", "paper_citations": 61, "paper_abstract": "Understanding entailment and contradiction is fundamental to understanding natural language, and inference about entailment and contradiction is a valuable testing ground for the development of semantic representations. However, machine learning research in this area has been dramatically limited by the lack of large-scale resources. To address this, we introduce the Stanford Natural Language Inference corpus, a new, freely available collection of labeled sentence pairs, written by humans doing a novel grounded task based on image captioning. At 570K pairs, it is two orders of magnitude larger than all other resources of its type. This increase in scale allows lexicalized classifiers to outperform some sophisticated existing entailment models, and it allows a neural network-based model to perform competitively on natural language inference benchmarks for the first time.", "paper_authors": ["Samuel R. Bowman", "Gabor Angeli", "Christopher Potts", "Christopher D. Manning"], "citations": ["a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "3febb2bed8865945e7fddc99efd791887bb7e14f", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027"], "references": ["f37e1b62a767a307c046404ca96bc140b3e68cb5", "27e5bd13d581ef682b96038dce4c18f260122352", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "687bac2d3320083eb4530bf18bb8f8f721477600", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 1.6029962174127794}, {"paper_id": "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "paper_title": "SemEval-2017 Task 1: Semantic Textual Similarity Multilingual and Crosslingual Focused Evaluation", "paper_year": 2017, "paper_venue": "SemEval@ACL", "paper_citations": 19, "paper_abstract": "Semantic Textual Similarity (STS) measures the meaning similarity of sentences. Applications include machine translation (MT), summarization, generation, question answering (QA), short answer grading, semantic search, dialog and conversational systems. The STS shared task is a venue for assessing the current state-of-the-art. The 2017 task focuses on multilingual and cross-lingual pairs with one sub-track exploring MT quality estimation (MTQE) data. The task obtained strong participation from 31 teams, with 17 participating in all language tracks. We summarize performance and review a selection of well performing methods. Analysis highlights common errors, providing insight into the limitations of existing models. To support ongoing work on semantic representations, the STS Benchmark is introduced as a new shared training and evaluation set carefully selected from the corpus of English STS shared task data (2012-2017).", "paper_authors": ["Daniel Matthew Cer", "Mona T. Diab", "Eneko Agirre", "Iñigo Lopez-Gazpio", "Lucia Specia"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "93b8da28d006415866bf48f9a6e06b5242129195", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "26e743d5bd465f49b9538deaf116c15e61b7951f", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "d87ceda3042f781c341ac17109d1e94a717f5f60", "1510cf4b8abea80b9f352325ca4c132887de21a0", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c"], "score": 1.6122550260167534}, {"paper_id": "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "paper_title": "SWAG: A Large-Scale Adversarial Dataset for Grounded Commonsense Inference", "paper_year": 2018, "paper_venue": "EMNLP", "paper_citations": 1, "paper_abstract": "Given a partial description like \"she opened the hood of the car,\" humans can reason about the situation and anticipate what might come next (\"then, she examined the engine\"). In this paper, we introduce the task of grounded commonsense inference, unifying natural language inference and commonsense reasoning. \nWe present SWAG, a new dataset with 113k multiple choice questions about a rich spectrum of grounded situations. To address the recurring challenges of the annotation artifacts and human biases found in many existing datasets, we propose Adversarial Filtering (AF), a novel procedure that constructs a de-biased dataset by iteratively training an ensemble of stylistic classifiers, and using them to filter the data. To account for the aggressive adversarial filtering, we use state-of-the-art language models to massively oversample a diverse set of potential counterfactuals. Empirical results demonstrate that while humans can solve the resulting inference problems with high accuracy (88%), various competitive models struggle on our task. We provide comprehensive analysis that indicates significant opportunities for future research.", "paper_authors": ["Rowan Zellers", "Yonatan Bisk", "Roy Schwartz", "Yejin Choi"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": ["f04df4e20a18358ea2f689b4c129781628ef7fc1", "93b8da28d006415866bf48f9a6e06b5242129195", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "27e5bd13d581ef682b96038dce4c18f260122352", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "3febb2bed8865945e7fddc99efd791887bb7e14f", "0e6824e137847be0599bb0032e37042ed2ef5045", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "2cd8e8f510c89c7c18268e8ad51c061e459ad321"], "score": 1.5850049148596472}, {"paper_id": "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "paper_title": "Improving Language Understanding by Generative Pre-Training", "paper_year": 2018, "paper_venue": "", "paper_citations": 6, "paper_abstract": "Natural language understanding comprises a wide range of diverse tasks such as textual entailment, question answering, semantic similarity assessment, and document classification. Although large unlabeled text corpora are abundant, labeled data for learning these specific tasks is scarce, making it challenging for discriminatively trained models to perform adequately. We demonstrate that large gains on these tasks can be realized by generative pre-training of a language model on a diverse corpus of unlabeled text, followed by discriminative fine-tuning on each specific task. In contrast to previous approaches, we make use of task-aware input transformations during fine-tuning to achieve effective transfer while requiring minimal changes to the model architecture. We demonstrate the effectiveness of our approach on a wide range of benchmarks for natural language understanding. Our general task-agnostic model outperforms discriminatively trained models that use architectures specifically crafted for each task, significantly improving upon the state of the art in 9 out of the 12 tasks studied. For instance, we achieve absolute improvements of 8.9% on commonsense reasoning (Stories Cloze Test), 5.7% on question answering (RACE), and 1.5% on textual entailment (MultiNLI).", "paper_authors": ["Alec Radford"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e"], "references": ["6e795c6e9916174ae12349f5dc3f516570c17ce8", "bc1d609520290e0460c49b685675eb5a57fa5935", "4361e64f2d12d63476fdc88faf72a0f70d9a2ffb", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "93b8da28d006415866bf48f9a6e06b5242129195", "a97dc52807d80454e78d255f9fbd7b0fab56bd03", "0bb4cadc80c0afaf29c57518dc9c06f8fcfa5f38", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "843959ffdccf31c6694d135fad07425924f785b1", "1e077413b25c4d34945cc2707e17e46ed4fe784a", "1510cf4b8abea80b9f352325ca4c132887de21a0", "3febb2bed8865945e7fddc99efd791887bb7e14f", "272216c1f097706721096669d85b2843c23fa77d", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "1a07186bc10592f0330655519ad91652125cd907", "687bac2d3320083eb4530bf18bb8f8f721477600", "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "0e6824e137847be0599bb0032e37042ed2ef5045", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "475354f10798f110d34792b6d88f31d6d5cb099e", "d1505c6123c102e53eb19dff312cb25cea840b72", "204e3073870fae3d05bcbc2f6a8e263d9b72e776", "4aa9f5150b46320f534de4747a2dd0cd7f3fe292"], "score": 1.8307563897312042}, {"paper_id": "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "paper_title": "A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference", "paper_year": 2017, "paper_venue": "NAACL-HLT", "paper_citations": 22, "paper_abstract": "This paper introduces the Multi-Genre Natural Language Inference (MultiNLI) corpus, a dataset designed for use in the development and evaluation of machine learning models for sentence understanding. In addition to being one of the largest corpora available for the task of NLI, at 433k examples, this corpus improves upon available resources in its coverage: it offers data from ten distinct genres of written and spoken English--making it possible to evaluate systems on nearly the full complexity of the language--and it offers an explicit setting for the evaluation of cross-genre domain adaptation.", "paper_authors": ["Adina Williams", "Nikita Nangia", "Samuel R. Bowman"], "citations": ["93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "ac11062f1f368d97f4c826c317bf50dcc13fdb59", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027"], "references": ["f04df4e20a18358ea2f689b4c129781628ef7fc1", "27e5bd13d581ef682b96038dce4c18f260122352", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "abd1c342495432171beb7ca8fd9551ef13cbd0ff", "272216c1f097706721096669d85b2843c23fa77d", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "9fa8d73e572c3ca824a04a5f551b602a17831bc5", "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 1.5763846564063524}, {"paper_id": "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "paper_title": "Supervised Learning of Universal Sentence Representations from Natural Language Inference Data", "paper_year": 2017, "paper_venue": "EMNLP", "paper_citations": 20, "paper_abstract": "Many modern NLP systems rely on word embeddings, previously trained in an unsupervised manner on large corpora, as base features. Efforts to obtain embeddings for larger chunks of text, such as sentences, have however not been so successful. Several attempts at learning unsupervised representations of sentences have not reached satisfactory enough performance to be widely adopted. In this paper, we show how universal sentence representations trained using the supervised data of the Stanford Natural Language Inference datasets can consistently outperform unsupervised methods like SkipThought vectors on a wide range of transfer tasks. Much like how computer vision uses ImageNet to obtain features, which can then be transferred to other tasks, our work tends to indicate the suitability of natural language inference for transfer learning to other NLP tasks. Our encoder is publicly available.", "paper_authors": ["Alexis Conneau", "Douwe Kiela", "Holger Schwenk", "Loïc Barrault", "Antoine Bordes"], "citations": ["a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "93b8da28d006415866bf48f9a6e06b5242129195", "1e077413b25c4d34945cc2707e17e46ed4fe784a", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "0c47cad9729c38d9db1f75491b1ee4bd883a5d4e", "bc1d609520290e0460c49b685675eb5a57fa5935", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb"], "references": ["87f40e6f3022adbc1f1905e3e506abad05a9964f", "2c03df8b48bf3fa39054345bafabfeff15bfd11d", "26e743d5bd465f49b9538deaf116c15e61b7951f", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "1510cf4b8abea80b9f352325ca4c132887de21a0", "39dba6f22d72853561a4ed684be265e179a39e4f", "272216c1f097706721096669d85b2843c23fa77d", "23694a80bf1b9b38215be3e23068dd75296bc90f", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "1a07186bc10592f0330655519ad91652125cd907", "0e6824e137847be0599bb0032e37042ed2ef5045", "71b7178df5d2b112d07e45038cb5637208659ff7", "4e88de2930a4435f737c3996287a90ff87b95c59", "38211dc39e41273c0007889202c69f841e02248a"], "score": 1.6911468302284878}, {"paper_id": "93b8da28d006415866bf48f9a6e06b5242129195", "paper_title": "GLUE: A Multi-Task Benchmark and Analysis Platform for Natural Language Understanding", "paper_year": 2018, "paper_venue": "ICLR", "paper_citations": 6, "paper_abstract": "For natural language understanding (NLU) technology to be maximally useful, both practically and as a scientific object of study, it must be general: it must be able to process language in a way that is not exclusively tailored to any one specific task or dataset. In pursuit of this objective, we introduce the General Language Understanding Evaluation benchmark (GLUE), a tool for evaluating and analyzing the performance of models across a diverse range of existing NLU tasks. GLUE is model-agnostic, but it incentivizes sharing knowledge across tasks because certain tasks have very limited training data. We further provide a hand-crafted diagnostic test suite that enables detailed linguistic analysis of NLU models. We evaluate baselines based on current methods for multi-task and transfer learning and find that they do not immediately give substantial improvements over the aggregate performance of training a separate model per task, indicating room for improvement in developing general and robust NLU systems.", "paper_authors": ["Alex Wang", "Amanpreet Singh", "Julian Michael", "Felix Hill", "Omer Levy", "Samuel R. Bowman"], "citations": ["9784fbf77295860b2e412137b86356d70b25e3c0", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb"], "references": ["007ab5528b3bd310a80d553cccad4b78dc496b02", "128cb6b891aee1b5df099acb48e2efecfcff689f", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "05dd7254b632376973f3a1b4d39485da17814df5", "cb0f3ee1e98faf92429d601cdcd76c69c1e484eb", "26e743d5bd465f49b9538deaf116c15e61b7951f", "071b16f25117fb6133480c6259227d54fc2a5ea0", "9784fbf77295860b2e412137b86356d70b25e3c0", "ee7b883e35d754ae4f71c21bb71f9f03e4ffbb2c", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "27e5bd13d581ef682b96038dce4c18f260122352", "5d833331b0e22ff359db05c62a8bca18c4f04b68", "1510cf4b8abea80b9f352325ca4c132887de21a0", "3febb2bed8865945e7fddc99efd791887bb7e14f", "272216c1f097706721096669d85b2843c23fa77d", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "687bac2d3320083eb4530bf18bb8f8f721477600", "a23fa96e7217ba0e9405d9e1fe3cdedd57b6e096", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "475354f10798f110d34792b6d88f31d6d5cb099e", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "score": 1.7429971193259592}, {"paper_id": "475354f10798f110d34792b6d88f31d6d5cb099e", "paper_title": "Automatically Constructing a Corpus of Sentential Paraphrases", "paper_year": 2005, "paper_venue": "IWP@IJCNLP", "paper_citations": 5, "paper_abstract": "An obstacle to research in automatic paraphrase identification and generation is the lack of large-scale, publiclyavailable labeled corpora of sentential paraphrases. This paper describes the creation of the recently-released Microsoft Research Paraphrase Corpus, which contains 5801 sentence pairs, each hand-labeled with a binary judgment as to whether the pair constitutes a paraphrase. The corpus was created using heuristic extraction techniques in conjunction with an SVM-based classifier to select likely sentence-level paraphrases from a large corpus of topicclustered news data. These pairs were then submitted to human judges, who confirmed that 67% were in fact semantically equivalent. In addition to describing the corpus itself, we explore a number of issues that arose in defining guidelines for the human raters.", "paper_authors": ["William B. Dolan", "Chris Brockett"], "citations": ["cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "93b8da28d006415866bf48f9a6e06b5242129195", "df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": [], "score": 1.5438436384299399}, {"paper_id": "128cb6b891aee1b5df099acb48e2efecfcff689f", "paper_title": "The Winograd Schema Challenge", "paper_year": 2011, "paper_venue": "AAAI Spring Symposium: Logical Formalizations of Commonsense Reasoning", "paper_citations": 8, "paper_abstract": "In this paper, we present an alternative to the Turing Test that has some conceptual and practical advantages. Like the original, it involves responding to typed English sentences, and English-speaking adults will have no difficulty with it. Unlike the original, the subject is not required to engage in a conversation and fool an interrogator into believing she is dealing with a person. Moreover, the test is arranged in such a way that having full access to a large corpus of English text might not help much. Finally, the interrogator or a third party will be able to decide unambiguously after a few minutes whether or not a subject has passed the test.", "paper_authors": ["Hector J. Levesque", "Ernest Davis", "Leora Morgenstern"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0"], "references": ["27e5bd13d581ef682b96038dce4c18f260122352"], "score": 1.4212926874367768}], [{"paper_id": "9784fbf77295860b2e412137b86356d70b25e3c0", "paper_title": "The Natural Language Decathlon: Multitask Learning as Question Answering", "paper_year": 2018, "paper_venue": "ArXiv", "paper_citations": 1, "paper_abstract": "Presented on August 28, 2018 at 12:15 p.m. in the Pettit Microelectronics Research Center, Room 102 A/B.", "paper_authors": ["Bryan McCann", "Nitish Shirish Keskar", "Caiming Xiong", "Richard Socher"], "citations": ["93b8da28d006415866bf48f9a6e06b5242129195"], "references": ["0a10d64beb0931efdc24a28edaa91d539194b2e2", "007ab5528b3bd310a80d553cccad4b78dc496b02", "128cb6b891aee1b5df099acb48e2efecfcff689f", "6e795c6e9916174ae12349f5dc3f516570c17ce8", "05dd7254b632376973f3a1b4d39485da17814df5", "39dba6f22d72853561a4ed684be265e179a39e4f", "4e88de2930a4435f737c3996287a90ff87b95c59", "87f40e6f3022adbc1f1905e3e506abad05a9964f", "071b16f25117fb6133480c6259227d54fc2a5ea0", "d7da009f457917aa381619facfa5ffae9329a6e9", "93b8da28d006415866bf48f9a6e06b5242129195", "8c1b00128e74f1cd92aede3959690615695d5101", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "27e5bd13d581ef682b96038dce4c18f260122352", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "1a07186bc10592f0330655519ad91652125cd907", "e0222a1ae6874f7fff128c3da8769ab95963da04", "687bac2d3320083eb4530bf18bb8f8f721477600", "f010affab57b5fcf1cd6be23df79d8ec98c7289c", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "93499a7c7f699b6630a86fad964536f9423bb6d0", "d1505c6123c102e53eb19dff312cb25cea840b72", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "score": 0.5942576427290107}, {"paper_id": "27e5bd13d581ef682b96038dce4c18f260122352", "paper_title": "The PASCAL Recognising Textual Entailment Challenge", "paper_year": 2005, "paper_venue": "MLCW", "paper_citations": 45, "paper_abstract": "This paper describes the PASCAL Network of Excellence first Recognising Textual Entailment (RTE-1) Challenge benchmark 1 . The RTE task is defined as recognizing, given two text fragments, whether the meaning of one text can be inferred (entailed) from the other. This application-independent task is suggested as capturing major inferences about the variability of semantic expression which are commonly needed across multiple applications. The Challenge has raised noticeable attention in the research community, attracting 17 submissions from diverse groups, suggesting the generic relevance of the task.", "paper_authors": ["Ido Dagan", "Oren Glickman", "Bernardo Magnini"], "citations": ["128cb6b891aee1b5df099acb48e2efecfcff689f", "93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "f04df4e20a18358ea2f689b4c129781628ef7fc1", "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "af5c4b80fbf847f69a202ba5a780a3dd18c1a027", "745d86adca56ec50761591733e157f84cfb19671"], "references": [], "score": 0.42280134621031873}]], [[{"paper_id": "05dd7254b632376973f3a1b4d39485da17814df5", "paper_title": "SQuAD: 100, 000+ Questions for Machine Comprehension of Text", "paper_year": 2016, "paper_venue": "EMNLP", "paper_citations": 58, "paper_abstract": "We present the Stanford Question Answering Dataset (SQuAD), a new reading comprehension dataset consisting of 100,000+ questions posed by crowdworkers on a set of Wikipedia articles, where the answer to each question is a segment of text from the corresponding reading passage. We analyze the dataset to understand the types of reasoning required to answer the questions, leaning heavily on dependency and constituency trees. We build a strong logistic regression model, which achieves an F1 score of 51.0%, a significant improvement over a simple baseline (20%). However, human performance (86.8%) is much higher, indicating that the dataset presents a good challenge problem for future research. \nThe dataset is freely available at this https URL", "paper_authors": ["Pranav Rajpurkar", "Jian Zhang", "Konstantin Lopyrev", "Percy Liang"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "f010affab57b5fcf1cd6be23df79d8ec98c7289c", "007ab5528b3bd310a80d553cccad4b78dc496b02", "93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "3febb2bed8865945e7fddc99efd791887bb7e14f", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "3c78c6df5eb1695b6a399e346dde880af27d1016", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["b1e20420982a4f923c08652941666b189b11b7fe", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "d1505c6123c102e53eb19dff312cb25cea840b72", "0b44fcbeea9415d400c5f5789d6b892b6f98daff", "38211dc39e41273c0007889202c69f841e02248a"], "score": 1.5245354055756106}, {"paper_id": "007ab5528b3bd310a80d553cccad4b78dc496b02", "paper_title": "Bidirectional Attention Flow for Machine Comprehension", "paper_year": 2016, "paper_venue": "ICLR", "paper_citations": 49, "paper_abstract": "Machine comprehension (MC), answering a query about a given context paragraph, requires modeling complex interactions between the context and the query. Recently, attention mechanisms have been successfully extended to MC. Typically these methods use attention to focus on a small portion of the context and summarize it with a fixed-size vector, couple attentions temporally, and/or often form a uni-directional attention. In this paper we introduce the Bi-Directional Attention Flow (BIDAF) network, a multi-stage hierarchical process that represents the context at different levels of granularity and uses bi-directional attention flow mechanism to obtain a query-aware context representation without early summarization. Our experimental evaluations show that our model achieves the state-of-the-art results in Stanford Question Answering Dataset (SQuAD) and CNN/DailyMail cloze test.", "paper_authors": ["Minjoon Seo", "Aniruddha Kembhavi", "Ali Farhadi", "Hannaneh Hajishirzi"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "f010affab57b5fcf1cd6be23df79d8ec98c7289c", "93b8da28d006415866bf48f9a6e06b5242129195", "9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "3febb2bed8865945e7fddc99efd791887bb7e14f", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "e0222a1ae6874f7fff128c3da8769ab95963da04", "3c78c6df5eb1695b6a399e346dde880af27d1016", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "05dd7254b632376973f3a1b4d39485da17814df5", "b1e20420982a4f923c08652941666b189b11b7fe", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "d1505c6123c102e53eb19dff312cb25cea840b72", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 1.5707934020667715}, {"paper_id": "f010affab57b5fcf1cd6be23df79d8ec98c7289c", "paper_title": "TriviaQA: A Large Scale Distantly Supervised Challenge Dataset for Reading Comprehension", "paper_year": 2017, "paper_venue": "ACL", "paper_citations": 19, "paper_abstract": "We present TriviaQA, a challenging reading comprehension dataset containing over 650K question-answer-evidence triples. TriviaQA includes 95K question-answer pairs authored by trivia enthusiasts and independently gathered evidence documents, six per question on average, that provide high quality distant supervision for answering the questions. We show that, in comparison to other recently introduced large-scale datasets, TriviaQA (1) has relatively complex, compositional questions, (2) has considerable syntactic and lexical variability between questions and corresponding answer-evidence sentences, and (3) requires more cross sentence reasoning to find answers. We also present two baseline algorithms: a feature-based classifier and a state-of-the-art neural network, that performs well on SQuAD reading comprehension. Neither approach comes close to human performance (23% and 40% vs. 80%), suggesting that TriviaQA is a challenging testbed that is worth significant future study. Data and code available at -- this http URL", "paper_authors": ["Mandar Joshi", "Eunsol Choi", "Daniel S. Weld", "Luke Zettlemoyer"], "citations": ["9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "3c78c6df5eb1695b6a399e346dde880af27d1016", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["007ab5528b3bd310a80d553cccad4b78dc496b02", "05dd7254b632376973f3a1b4d39485da17814df5", "b1e20420982a4f923c08652941666b189b11b7fe", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "146f6f6ed688c905fb6e346ad02332efd5464616", "d1505c6123c102e53eb19dff312cb25cea840b72"], "score": 1.4860635824218904}, {"paper_id": "8c1b00128e74f1cd92aede3959690615695d5101", "paper_title": "QANet: Combining Local Convolution with Global Self-Attention for Reading Comprehension", "paper_year": 2018, "paper_venue": "ICLR", "paper_citations": 6, "paper_abstract": "Current end-to-end machine reading and question answering (Q\\&A) models are primarily based on recurrent neural networks (RNNs) with attention. Despite their success, these models are often slow for both training and inference due to the sequential nature of RNNs. We propose a new Q\\&A model that does not require recurrent networks: It consists exclusively of attention and convolutions, yet achieves equivalent or better performance than existing models. On the SQuAD dataset, our model is 3x to 13x faster in training and 4x to 9x faster in inference. The speed-up gain allows us to train the model with much more data. We hence combine our model with data generated by backtranslation from a neural machine translation model. This data augmentation technique not only enhances the training examples but also diversifies the phrasing of the sentences, which results in immediate accuracy improvements. Our single model achieves 84.6 F1 score on the test set, which is significantly better than the best published F1 score of 81.8.", "paper_authors": ["Adams Wei Yu", "David Dohan", "Minh-Thang Luong", "Rui Zhao", "Kai Chen", "Mohammad Norouzi", "Quoc V. Le"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992", "26b47e35fe6e4260fdf7b7cc98f279a73c277494", "9784fbf77295860b2e412137b86356d70b25e3c0"], "references": ["f010affab57b5fcf1cd6be23df79d8ec98c7289c", "071b16f25117fb6133480c6259227d54fc2a5ea0", "007ab5528b3bd310a80d553cccad4b78dc496b02", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "05dd7254b632376973f3a1b4d39485da17814df5", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "272216c1f097706721096669d85b2843c23fa77d", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "3c78c6df5eb1695b6a399e346dde880af27d1016", "93499a7c7f699b6630a86fad964536f9423bb6d0", "d1505c6123c102e53eb19dff312cb25cea840b72", "204e3073870fae3d05bcbc2f6a8e263d9b72e776"], "score": 1.5565633297961075}, {"paper_id": "3c78c6df5eb1695b6a399e346dde880af27d1016", "paper_title": "Simple and Effective Multi-Paragraph Reading Comprehension", "paper_year": 2017, "paper_venue": "ACL", "paper_citations": 9, "paper_abstract": "We consider the problem of adapting neural paragraph-level question answering models to the case where entire documents are given as input. Our proposed solution trains models to produce well calibrated confidence scores for their results on individual paragraphs. We sample multiple paragraphs from the documents during training, and use a shared-normalization training objective that encourages the model to produce globally correct output. We combine this method with a state-of-the-art pipeline for training models on document QA data. Experiments demonstrate strong performance on several document QA datasets. Overall, we are able to achieve a score of 71.3 F1 on the web portion of TriviaQA, a large improvement from the 56.7 F1 of the previous best system.", "paper_authors": ["Christopher Clark", "Matt Gardner"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "8c1b00128e74f1cd92aede3959690615695d5101", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "3febb2bed8865945e7fddc99efd791887bb7e14f", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["f010affab57b5fcf1cd6be23df79d8ec98c7289c", "007ab5528b3bd310a80d553cccad4b78dc496b02", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "05dd7254b632376973f3a1b4d39485da17814df5", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "d1505c6123c102e53eb19dff312cb25cea840b72", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "score": 1.563294503096384}, {"paper_id": "26b47e35fe6e4260fdf7b7cc98f279a73c277494", "paper_title": "Multi-granularity hierarchical attention fusion networks for reading comprehension and question answering", "paper_year": 2018, "paper_venue": "ACL", "paper_citations": 3, "paper_abstract": "This paper describes a novel hierarchical attention network for reading comprehension style question answering, which aims to answer questions for a given narrative paragraph. In the proposed method, attention and fusion are conducted horizontally and vertically across layers at different levels of granularity between question and paragraph. Specifically, it first encode the question and paragraph with fine-grained language embeddings, to better capture the respective representations at semantic level. Then it proposes a multi-granularity fusion approach to fully fuse information from both global and attended representations. Finally, it introduces a hierarchical attention network to focuses on the answer span progressively with multi-level softalignment. Extensive experiments on the large-scale SQuAD and TriviaQA datasets validate the effectiveness of the proposed method. At the time of writing the paper (Jan. 12th 2018), our model achieves the first position on the SQuAD leaderboard for both single and ensemble models. We also achieves state-of-the-art results on TriviaQA, AddSent and AddOne-Sent datasets.", "paper_authors": ["Wei Wang", "Chen Wu", "Ming Yan"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": ["f010affab57b5fcf1cd6be23df79d8ec98c7289c", "007ab5528b3bd310a80d553cccad4b78dc496b02", "8c1b00128e74f1cd92aede3959690615695d5101", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "05dd7254b632376973f3a1b4d39485da17814df5", "b1e20420982a4f923c08652941666b189b11b7fe", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "3febb2bed8865945e7fddc99efd791887bb7e14f", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "3c78c6df5eb1695b6a399e346dde880af27d1016", "d1505c6123c102e53eb19dff312cb25cea840b72"], "score": 1.5692528694883454}, {"paper_id": "27e98e09cf09bc13c913d01676e5f32624011050", "paper_title": "U-Net: Machine Reading Comprehension with Unanswerable Questions", "paper_year": 2018, "paper_venue": "ArXiv", "paper_citations": 1, "paper_abstract": "Machine reading comprehension with unanswerable questions is a new challenging task for natural language processing. A key subtask is to reliably predict whether the question is unanswerable. In this paper, we propose a unified model, called U-Net, with three important components: answer pointer, no-answer pointer, and answer verifier. We introduce a universal node and thus process the question and its context passage as a single contiguous sequence of tokens. The universal node encodes the fused information from both the question and passage, and plays an important role to predict whether the question is answerable and also greatly improves the conciseness of the U-Net. Different from the state-of-art pipeline models, U-Net can be learned in an end-to-end fashion. The experimental results on the SQuAD 2.0 dataset show that U-Net can effectively predict the unanswerability of questions and achieves an F1 score of 71.7 on SQuAD 2.0.", "paper_authors": ["Fu Sun", "Linyang Li", "Xipeng Qiu", "Yang P. Liu"], "citations": ["df2b0e26d0599ce3e70df8a9da02e51594e0e992"], "references": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "007ab5528b3bd310a80d553cccad4b78dc496b02", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "05dd7254b632376973f3a1b4d39485da17814df5", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "3febb2bed8865945e7fddc99efd791887bb7e14f", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "272216c1f097706721096669d85b2843c23fa77d", "e0222a1ae6874f7fff128c3da8769ab95963da04", "3c78c6df5eb1695b6a399e346dde880af27d1016", "d1505c6123c102e53eb19dff312cb25cea840b72", "26b47e35fe6e4260fdf7b7cc98f279a73c277494", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 1.51293534241503}, {"paper_id": "e0222a1ae6874f7fff128c3da8769ab95963da04", "paper_title": "Reinforced Mnemonic Reader for Machine Reading Comprehension", "paper_year": 2017, "paper_venue": "IJCAI", "paper_citations": 5, "paper_abstract": "In this paper, we introduce the Reinforced Mnemonic Reader for machine reading comprehension tasks, which enhances previous attentive readers in two aspects. First, a reattention mechanism is proposed to refine current attentions by directly accessing to past attentions that are temporally memorized in a multi-round alignment architecture, so as to avoid the problems of attention redundancy and attention deficiency. Second, a new optimization approach, called dynamic-critical reinforcement learning, is introduced to extend the standard supervised method. It always encourages to predict a more acceptable answer so as to address the convergence suppression problem occurred in traditional reinforcement learning algorithms. Extensive experiments on the Stanford Question Answering Dataset (SQuAD) show that our model achieves state-of-the-art results. Meanwhile, our model outperforms previous systems by over 6% in terms of both Exact Match and F1 metrics on two adversarial SQuAD datasets.", "paper_authors": ["Minghao Hu", "Yuxing Peng", "Zhen Huang", "Xipeng Qiu", "Furu Wei", "Ming Zhou"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "df2b0e26d0599ce3e70df8a9da02e51594e0e992", "9784fbf77295860b2e412137b86356d70b25e3c0"], "references": ["2c03df8b48bf3fa39054345bafabfeff15bfd11d", "071b16f25117fb6133480c6259227d54fc2a5ea0", "007ab5528b3bd310a80d553cccad4b78dc496b02", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "3febb2bed8865945e7fddc99efd791887bb7e14f", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "272216c1f097706721096669d85b2843c23fa77d", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 1.4876557014481382}], [{"paper_id": "d1505c6123c102e53eb19dff312cb25cea840b72", "paper_title": "Teaching Machines to Read and Comprehend", "paper_year": 2015, "paper_venue": "NIPS", "paper_citations": 73, "paper_abstract": "Teaching machines to read natural language documents remains an elusive challenge. Machine reading systems can be tested on their ability to answer questions posed on the contents of documents that they have seen, but until now large scale training and test datasets have been missing for this type of evaluation. In this work we define a new methodology that resolves this bottleneck and provides large scale supervised reading comprehension data. This allows us to develop a class of attention based deep neural networks that learn to read real documents and answer complex questions with minimal prior knowledge of language structure.", "paper_authors": ["Karl Moritz Hermann", "Tomás Kociský", "Edward Grefenstette", "Lasse Espeholt", "Will Kay", "Mustafa Suleyman", "Phil Blunsom"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "f010affab57b5fcf1cd6be23df79d8ec98c7289c", "007ab5528b3bd310a80d553cccad4b78dc496b02", "9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "cd18800a0fe0b668a1cc19f2ec95b5003d0a5035", "05dd7254b632376973f3a1b4d39485da17814df5", "b1e20420982a4f923c08652941666b189b11b7fe", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "3c78c6df5eb1695b6a399e346dde880af27d1016", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "2538e3eb24d26f31482c479d95d2e26c0e79b990", "766ce989b8b8b984f7a4691fd8c9af4bdb2b74cd", "03ff3f8f4d5a700fbe8f3a3e63a39523c29bb60f"], "score": 0.5029674169105478}, {"paper_id": "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "paper_title": "Gated Self-Matching Networks for Reading Comprehension and Question Answering", "paper_year": 2017, "paper_venue": "ACL", "paper_citations": 24, "paper_abstract": "In this paper, we present the gated selfmatching networks for reading comprehension style question answering, which aims to answer questions from a given passage. We first match the question and passage with gated attention-based recurrent networks to obtain the question-aware passage representation. Then we propose a self-matching attention mechanism to refine the representation by matching the passage against itself, which effectively encodes information from the whole passage. We finally employ the pointer networks to locate the positions of answers from the passages. We conduct extensive experiments on the SQuAD dataset. The single model achieves 71.3% on the evaluation metrics of exact match on the hidden test set, while the ensemble model further boosts the results to 75.9%. At the time of submission of the paper, our model holds the first place on the SQuAD leaderboard for both single and ensemble model.", "paper_authors": ["Wenhui Wang", "Nan Yang", "Furu Wei", "Baobao Chang", "Ming Zhou"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "3febb2bed8865945e7fddc99efd791887bb7e14f", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "e0222a1ae6874f7fff128c3da8769ab95963da04", "3c78c6df5eb1695b6a399e346dde880af27d1016", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["071b16f25117fb6133480c6259227d54fc2a5ea0", "007ab5528b3bd310a80d553cccad4b78dc496b02", "f37e1b62a767a307c046404ca96bc140b3e68cb5", "05dd7254b632376973f3a1b4d39485da17814df5", "b1e20420982a4f923c08652941666b189b11b7fe", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "2cd8e8f510c89c7c18268e8ad51c061e459ad321", "47a87c2cbdd928bb081974d308b3d9cf678d257e", "d1505c6123c102e53eb19dff312cb25cea840b72", "0b544dfe355a5070b60986319a3f51fb45d1348e", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 0.516040890777401}, {"paper_id": "b1e20420982a4f923c08652941666b189b11b7fe", "paper_title": "A Thorough Examination of the CNN/Daily Mail Reading Comprehension Task", "paper_year": 2016, "paper_venue": "ACL", "paper_citations": 35, "paper_abstract": "Enabling a computer to understand a document so that it can answer comprehension questions is a central, yet unsolved goal of NLP. A key factor impeding its solution by machine learned systems is the limited availability of human-annotated data. Hermann et al. (2015) seek to solve this problem by creating over a million training examples by pairing CNN and Daily Mail news articles with their summarized bullet points, and show that a neural network can then be trained to give good performance on this task. In this paper, we conduct a thorough examination of this new reading comprehension task. Our primary aim is to understand what depth of language understanding is required to do well on this task. We approach this from one side by doing a careful hand-analysis of a small subset of the problems and from the other by showing that simple, carefully designed systems can obtain accuracies of 72.4% and 75.8% on these two datasets, exceeding current state-of-the-art results by over 5% and approaching what we believe is the ceiling for performance on this task.1", "paper_authors": ["Danqi Chen", "Jason Bolton", "Christopher D. Manning"], "citations": ["f010affab57b5fcf1cd6be23df79d8ec98c7289c", "007ab5528b3bd310a80d553cccad4b78dc496b02", "05dd7254b632376973f3a1b4d39485da17814df5", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["f37e1b62a767a307c046404ca96bc140b3e68cb5", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "93499a7c7f699b6630a86fad964536f9423bb6d0", "d1505c6123c102e53eb19dff312cb25cea840b72", "0b544dfe355a5070b60986319a3f51fb45d1348e"], "score": 0.4130177063516322}, {"paper_id": "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "paper_title": "Dynamic Coattention Networks For Question Answering", "paper_year": 2016, "paper_venue": "ICLR", "paper_citations": 31, "paper_abstract": "Several deep learning models have been proposed for question answering. How- ever, due to their single-pass nature, they have no way to recover from local maxima corresponding to incorrect answers. To address this problem, we introduce the Dynamic Coattention Network (DCN) for question answering. The DCN first fuses co-dependent representations of the question and the document in order to focus on relevant parts of both. Then a dynamic pointer decoder iterates over potential answer spans. This iterative procedure enables the model to recover from initial local maxima corresponding to incorrect answers. On the Stanford question answering dataset, a single DCN model improves the previous state of the art from 71.0% F1 to 75.9%, while a DCN ensemble obtains 80.4% F1.", "paper_authors": ["Caiming Xiong", "Victor Zhong", "Richard Socher"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "9784fbf77295860b2e412137b86356d70b25e3c0", "8c1b00128e74f1cd92aede3959690615695d5101", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "bc8fa64625d9189f5801837e7b133e7fe3c581f7", "e0222a1ae6874f7fff128c3da8769ab95963da04", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["f37e1b62a767a307c046404ca96bc140b3e68cb5", "05dd7254b632376973f3a1b4d39485da17814df5", "b1e20420982a4f923c08652941666b189b11b7fe", "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "272216c1f097706721096669d85b2843c23fa77d", "0b3cfbf79d50dae4a16584533227bb728e3522aa", "93499a7c7f699b6630a86fad964536f9423bb6d0", "d1505c6123c102e53eb19dff312cb25cea840b72", "6c8b30f63f265c32e26d999aa1fef5286b8308ad"], "score": 0.45437512619681886}, {"paper_id": "1ee46c3b71ebe336d0b278de9093cfca7af7390b", "paper_title": "The Goldilocks Principle: Reading Children's Books with Explicit Memory Representations", "paper_year": 2015, "paper_venue": "ICLR", "paper_citations": 42, "paper_abstract": "Abstract: We introduce a new test of how well language models capture meaning in children's books. Unlike standard language modelling benchmarks, it distinguishes the task of predicting syntactic function words from that of predicting lower-frequency words, which carry greater semantic content. We compare a range of state-of-the-art models, each with a different way of encoding what has been previously read. We show that models which store explicit representations of long-term contexts outperform state-of-the-art neural language models at predicting semantic content words, although this advantage is not observed for syntactic function words. Interestingly, we find that the amount of text encoded in a single memory representation is highly influential to the performance: there is a sweet-spot, not too big and not too small, between single words and full sentences that allows the most meaningful information in a text to be effectively retained and recalled. Further, the attention over such window-based memories can be trained effectively through self-supervision. We then assess the generality of this principle by applying it to the CNN QA benchmark, which involves identifying named entities in paraphrased summaries of news articles, and achieve state-of-the-art performance.", "paper_authors": ["Felix Hill", "Antoine Bordes", "Sumit Chopra", "Jason Weston"], "citations": ["27e98e09cf09bc13c913d01676e5f32624011050", "f010affab57b5fcf1cd6be23df79d8ec98c7289c", "007ab5528b3bd310a80d553cccad4b78dc496b02", "8c1b00128e74f1cd92aede3959690615695d5101", "05dd7254b632376973f3a1b4d39485da17814df5", "b1e20420982a4f923c08652941666b189b11b7fe", "b798cfd967e1a9ca5e7bc995d33a907bf65d1c7f", "5171157c2c09a85ad6558c5c03da6b75b0cf5fe6", "e0222a1ae6874f7fff128c3da8769ab95963da04", "3c78c6df5eb1695b6a399e346dde880af27d1016", "26b47e35fe6e4260fdf7b7cc98f279a73c277494"], "references": ["d1505c6123c102e53eb19dff312cb25cea840b72", "2b669398c4cf2ebe04375c8b1beae20f4ac802fa", "146f6f6ed688c905fb6e346ad02332efd5464616", "93499a7c7f699b6630a86fad964536f9423bb6d0"], "score": 0.484755063668199}]]], "clusterNames": ["neural network", "machine translation", "sentence representation", "language model", "language inference", "reading comprehension"], "importance": [0.10658092027227352, 0.14052304508559332, 0.1810971511798507, 0.2678711355049088, 0.16519512619233528, 0.13873262176503834], "related_paper_titles": ["Improving Language Understanding by Generative Pre-Training", "Glove: Global Vectors for Word Representation", "Deep contextualized word representations", "GLUE: A Multi-Task Benchmark and Analysis Platform for Natural Language Understanding", "Distributed Representations of Words and Phrases and their Compositionality"]}
